-- Created at 26.12.2016 22:37 using David Grudl MySQL Dump Utility
-- Host: cms.newday.me
-- MySQL Server: 5.6.32-log
-- Database: cms

SET NAMES utf8;
SET SQL_MODE='NO_AUTO_VALUE_ON_ZERO';
SET FOREIGN_KEY_CHECKS=0;
-- --------------------------------------------------------

DROP TABLE IF EXISTS `nd_blog_article`;

CREATE TABLE `nd_blog_article` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `article_key` char(16) NOT NULL COMMENT '文章标识',
  `article_title` varchar(150) NOT NULL DEFAULT '' COMMENT '标题',
  `article_author` varchar(20) NOT NULL DEFAULT '' COMMENT '作者',
  `article_info` varchar(250) NOT NULL DEFAULT '' COMMENT '简介',
  `article_cover` varchar(150) NOT NULL DEFAULT '' COMMENT '封面',
  `article_cate` int(11) NOT NULL DEFAULT '0' COMMENT '分类ID',
  `article_tags` varchar(250) NOT NULL DEFAULT '' COMMENT '标签',
  `article_origin` varchar(1000) NOT NULL DEFAULT '' COMMENT '原文链接',
  `article_sort` int(11) NOT NULL DEFAULT '0' COMMENT '排序',
  `article_content` mediumtext NOT NULL COMMENT '内容',
  `article_view` int(11) NOT NULL DEFAULT '0' COMMENT '浏览人数',
  `article_ip` varchar(20) NOT NULL COMMENT '访问IP',
  `article_status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '状态，0：待发布，1：发布',
  `create_time` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  `update_time` int(11) NOT NULL DEFAULT '0' COMMENT '更新时间',
  `delete_time` int(11) NOT NULL DEFAULT '0' COMMENT '删除时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

INSERT INTO `nd_blog_article` (`id`, `article_key`, `article_title`, `article_author`, `article_info`, `article_cover`, `article_cate`, `article_tags`, `article_origin`, `article_sort`, `article_content`, `article_view`, `article_ip`, `article_status`, `create_time`, `update_time`, `delete_time`) VALUES
(1,	'd79666a3069ca762',	'平凡的大上海',	'毕业生',	'有时候喜欢上一座城市，连我们自己都不知道是为什么，但就是这种茫然的感觉，才让我们以更加不服气的态度生活的更带劲儿！',	'//static.newday.me/cms/image/59da05b04ddb4da914f0f40647aaefd1.jpg',	1,	',平凡,上海,',	'http://www.sanwen.net/subject/3885590/',	0,	'<p>有时候喜欢上一座城市，连我们自己都不知道是为什么，但就是这种茫然的感觉，才让我们以更加不服气的态度生活的更带劲儿！\r\n</p><p>前几天公司领导为我们培训，说过这样一句话：上海，这是一座很现实的城市，很多人来上海，可能就是喜欢这种被奋斗的感觉，当周围所有人都在奋斗都在努力挣钱的时候，我们也不可能太安逸的生活着。\r\n</p><p>我或多或少被这句话触动了，因为在我最茫然的时候，是这种被奋斗的感觉，才让我更清楚自己必须是要留在上海的。\r\n</p><p>当初我来上海的目的很明确，就是喜欢阅读喜欢写字，来上海找一份可以每天写字的工作。而当短短几个月后，我终于明白，喜欢写字跟写字的工作完全不是一回事，写字是内心感情的流露，而写字的工作完全是为商业化服务，于是无奈之中放弃了那个当初的大目标，因为我不愿意写一些没有情感的文字骷髅……\r\n</p><p>半年前我还在苏州工作，机器的轰鸣整日整夜在我的耳旁翻江倒海，然后每天一个人在可以容纳上千人的餐厅里吃饭，在车间里的角落躲着领导吹空调、看小说，趴在窗台上看夏天的热浪一阵阵在水泥地上翻腾，也看黄昏过后满天繁星的夜空。\r\n</p><p>但是半年后我已经在上海了，戴着耳机哼着逍遥调穿梭在上海茫茫的人海之中，与所有陌生人拥挤在地铁狭小的车厢里，进进出出一座座超高层商务写字楼，有时候在红绿灯的十字路口停下脚步，望着头顶的摩天大厦会发出一声“好高呀”的感叹，于是赶快拿出手机把它拍下来，但明亮的瞳孔里随之是对现实束手无措的茫然。( 文章阅读网：www.sanwen.net )\r\n</p><p>12月份，我在上海已经是第三份工作了，前两份每天的工作内容就是写字，写金融的文字，写人物的介绍，写商业性的宣传，每个字都写的很累，在从未经过内心润化而生产出来的文字是苍白的，我受不了这种没有情感不真实的文字，对我而言，生产文子是一个艺术创造情感再塑的过程，没有艺术的文字是没有意义的！\r\n</p><p>晒着12月份上海明媚温暖的阳光，与我在上海认识的第一个朋友小强走在“南京路步行街”上，走在这个标志着上海最最繁华的商业人行街道上，面对着阳光微笑，也看着周围微笑的人群心底一阵阵惬意。\r\n</p><p>不知道明天会不会依然晴朗，但所有人在今天能够享受的时候，一定都很快乐。\r\n</p><p>我们之间是在公寓相识，在我来上海的第一个落脚点遇见，同住一间房，每天一起起床，一起买早餐，一起等公交，然后在人群中道别去各自的公司上班，又在傍晚不同时间回到那间房。\r\n</p><p>我们性格相似，所以聊得来，一起买过烤鸭，一起炸过鸡腿，一起吃西红柿炒蛋，一起在下班后跑步，也一起在微信上聊妞儿，于是我明白，原来相似的人都是心灵相通的，兴趣、想法、做事方法……我们相识相知也许是一种必然吧。\r\n</p><p>“南京路步行街”就跟我去过的苏州“观前街”、太原“柳巷”一样，汇聚了一座城市的历史、文化、餐饮小吃、世贸百货等等，是一座城市的现代标志，我们进出一家家高档服饰商店，身上穿着百余元的外套，眼里看着上千元的衣服，却无论如何看不出这些衣服好在哪里，最后无奈也许品味不同吧！\r\n</p><p>好多年轻漂亮的销售员只看我们一眼，连介绍都不介绍，因为看我们的装束，根本就不是买得起的人，这些店，是服务于有钱人的。\r\n</p><p>进出三星、华为、苹果手机体验店，拿着他们的新手机爱不释手，尽情把玩一番，却从来不敢正眼看价格，最后灰溜溜地离开，拿出自己的手机看看时间，想想要吃点什么东西填饱肚子。\r\n</p><p>新世界城、百联世贸是做落在上海市中心的两座大型百货大楼，一层层转上去，从不敢说要买什么东西，一遍遍乘电梯，一遍遍数着门店的名字，也一遍遍在心底告诫自己：挣不到钱，在这座城市是无法生活的更好一点的！\r\n</p><p>有时候我会想，究竟是精神世界充实一些好，还是物质生活充实一点好呢？但是在今天我终于明白，每个人都在朝着物质生活充实的目标奋斗，物质生活是基础，但精神世界充实与否才是人与人之间的差异。\r\n</p><p>生活，是每个人的目标，但是有质量的生活，却不是每个人都能够做到的！\r\n</p><p>人民广场、人民公园是上海留在市中心的一片绿地，也是仅有的决不能用作商业开发的一片净土，亚热带长绿阔叶植物在其中享受着冬日的温暖阳光，游乐场里过山车、旋转马、碰碰车都在安静的喧闹着，不知道为什么，我仿佛把周围的喧闹声全都隔离了，心里是茫然，是不知道明天在哪里的恐慌紧张，但是又平静一如这方繁华中的净土，屏住呼吸期待着明天那个全新的自己。\r\n</p><p>每个人都在这座物欲横流、灯火辉煌的大城市里拼搏，就像那句话说的：这是一座需要奋斗的城市，也是一座被奋斗的城市！\r\n</p><p>来上海已经有一段时间了，数数身上的钱，入不敷出，每天挣扎在这种水深火热之中，只能咬紧牙关不断提高自己，要不然，就被城市生活的规则淘汰了。\r\n</p><p>回忆二十岁在校园里许下的诺言：哪怕自己的青春苦一点、累一点，也不怕，但是一定要做自己喜欢的事，发挥自己的价值心愿。如今，那时候诺言里苦一点、累一点实现了，但是做自己喜欢的事却还遥遥无期，可是，如果一下子都实现的话，青春也就没什么意义了吧。\r\n</p><p>平凡的大上海，看到更多的是一张张平静的面孔，在周末的阳光下微笑，即使工作一周心里很累，但微笑就是给他们自己最大的宽慰。\r\n</p><p>曾经自己非常羡慕上海这座城市，认为上海一定是那种远离世俗的城市，但其实，所有的城市都一样平凡，所有城市里都有平凡生活的人们，只不过是理念不同、意识不同而已。\r\n</p><p>我和小强在2016年12月17日走在上海最最繁华的街头，一遍遍回忆过去也感知心底的幸福，一遍遍渴望未来也对明天心存畏惧，当有一天，我们会不会买一件一千多块钱的衣服，我们会不会吃一顿一千多块钱的大餐，我们会不会在上海的街头没有后顾之忧地去痛痛快快消费呢？\r\n</p><p>跟其他城市一样，上海这是一座平凡的城市，但是如果我们想着它不平凡，那它就有可能真的不平凡了，甚至包括我们也不平凡了。\r\n</p><p>可是未来会怎么样，谁知道呢？\r\n</p><p>我们继续走下去吧！\r\n</p><p>——2016.12.18\r\n</p><p>我是一个90后狮子男，如今毕业不久一个人来上海打拼，接下来我会用文字记录下自己所走的每一步。如果你跟我一样，我希望你会喜欢我的文字，并告诉你周围的人这个世界并不寒冷，我相信我们会陪伴着走下去，直到看到人生的光芒！</p><p><br></p>',	0,	'',	1,	1481558400,	1482506952,	0),
(2,	'760451a286edf50c',	'爱自己，就活出真实的自己',	'流离夏',	'毕业后我去了南方的城市，跟很多漂在他乡的游子一样，花很长的时间去找工作，找自己，也找属于自己那份参与感和归属感。',	'//static.newday.me/cms/image/d46af9079bbbc27047e5f0ebb9fc4dfc.jpg',	1,	',自己,真实,',	'http://www.sanwen.net/subject/3886516/',	0,	'<p>毕业后我去了南方的城市，跟很多漂在他乡的游子一样，花很长的时间去找工作，找自己，也找属于自己那份参与感和归属感。时间久了，也会变得急躁和平静，急躁的是心情，平静的是憧憬。\r\n</p><p>从出发到现在，一直都有很多人说，你为什么跑那么远，如果留在家乡，有同学，有朋友，有期待，岂不更好？就像刚开始时我的想法，在他乡，注定要承受比他人更孤独的独立，注定要漂泊更多的漂泊获取温暖，注定要努力更多的努力证明自我，归于生活的一切，哪有那么简单呢。\r\n</p><p>心静则暖\r\n</p><p>在日复一日，年复一年的奔波过后，你相对的稳定下来，找到了曾经期待的岗位，不再急躁，不再抱怨。你发现生活越来越清晰，只是，自己却越来越模糊了。走在回家的路上，看着手机，再看看天空，不自觉的笑了。\r\n</p><p>“你现在做什么工作呢”\r\n</p><p>“我在XX公司做XX”“凑合着过吧”\r\n</p><p>“我觉得你不去做编辑真是太可惜了”“你看，每次你扯淡我们都会围观，然后开怀一笑，点个赞”\r\n</p><p>“如果我真的做了编辑，你们就不会再看到我扯淡了”“我不扯淡，你们赞点给谁呢”\r\n</p><p>“哦，不过我还是相信你可以”\r\n</p><p>“就这样，有我，有文字，有你们，有欢笑，多好呀”\r\n</p><p>我们时常会觉得生活真是操蛋的玩意，其实是因为被生活改变太多太多吧。《水浒》中的林教头当初是何等的情怀，就算被逼上梁山还一心想着报仇雪恨，然而在手仞高俅未果后，他自己都说，我林冲已然不是当初上山的林冲了，连高俅都杀不了，活着还有什么意义，最终含恨而死。\r\n</p><p>生活中，不得不的事情太多太多，是否也可以说成是自己能力不及所致，为此而去接受一些不得不的改变。\r\n</p><p>就算如此，也不要把自己全权交给命运，有的东西少被改变一点，就离真实的自己更近一点，自己也会变得更加清晰。就像我喜欢写，喜欢没有任何条款制约的胡诌，那才是真的我。\r\n</p><p></p><p>所以，爱自己，就活出真实的自己。\r\n</p><p><br></p>',	0,	'',	1,	1481558400,	1482558629,	0),
(3,	'1f298f29081f5cb7',	'20岁，你迷茫又着急',	'网络',	'20多岁，你迷茫又着急。你想要房子想要汽车，你想要旅行想要享受生活。你那么年轻却窥觑整个世界，你那么浮躁却想要看透生活。',	'//static.newday.me/cms/image/5a416ee8a89ae2e754417c4beb97b562.jpg',	1,	',20岁,迷茫,',	'',	0,	'<p>20多岁，你迷茫又着急。你想要房子想要汽车，你想要旅行想要享受生活。你那么年轻却窥觑整个世界，你那么浮躁却想要看透生活。\r\n</p><h3>一、别急，千万别急\r\n</h3><p>上周在南京出差，深夜拖着疲惫去跟朋友见面，畅谈至凌晨两点。回到酒店已近三点，同屋的同事竟还未睡，点根烟，对着65层下的旧都夜景发呆。他非健谈之人，光头，一副艺术家模样，气质有天然的冷漠，之前交往无非公事，更无多话。不知道怎么提到了当今青年人的心态和选择，竟就聊起来，再也收不住。\r\n</p><p>他18岁出来闯荡，没念过大学，今年38岁，是一本著名杂志的设计总监。如果这是一个老套的励志故事，我可能再无兴趣听下去。但他说，我不知道你们这代人是怎么想的，我反感几零后几零后的区分和标签，我跟很多自己的同龄人聊不来。人是靠价值相互认同的，而不是年龄。现在你们这代人看上去都挺急，房子、车子、票子，但就是你们同龄人，也不全是这么想的吧？我点头。他继续道，其实，每一代人都有自己的苦闷，真的，都是这么过来的。\r\n</p><p>两年前我才有了自己的房子，今年儿子两岁了。我觉得一切挺好。25岁时我在一家体制内单位工作，已有七八年工作经验，呆不下去了，要走。领导请我喝酒。他一口闷了一杯酒，跟我说，你还年轻，别想那么多，别着急，做该做的事。就这一句话，我受用至今。我年轻时爱玩、浮躁，总有各种诱惑扑过来。我就记着老领导这句话，其他都不想，就做自己的事，一晃眼就到现在了。他继续道，你要说奋斗什么的，我从来没有，就是一步步来。房子、车子这些东西，说真的，只要你不傻不笨，踏实做该做的事，到时间都会有的，不可能没有。别去想它。别去管别人怎么做，相信自己的判断。守得住，慢慢来。(&nbsp;文章阅读网：www.sanwen.net&nbsp;)\r\n</p><p>他说，守得住，慢慢来。\r\n</p><p>一个月前，我刚来，抱回家十几本往期杂志。匆匆翻完，绝望地陷进沙发里，给老师发短信：文章何时能写过四大主笔啊？差距不是一丁半点。他回，别急，你年轻。我说，我都24岁了，还看不到一点希望。他回，才24岁。我们最年轻的也30出头了，别急。\r\n</p><p>才24岁。他连说两次，别急。\r\n</p><p>李笑来在《把时间当作朋友》里写，我们总是对短期收益期望过高，却对长期收益期望过低。\r\n</p><p>他指英语，也说人生。\r\n</p><p>说来说去，还是急。\r\n</p><h3>二、“出名要趁早”，害了多少人\r\n</h3><p>有人说，你想成为什么样的人，就到那个人身边去。并不是每个人都有这样的幸运，但这句话或不只关乎职业生涯，也关乎生活智慧。人们容易放大眼前的痛苦或成就，跟年长却开明的前辈交流，他们一望便知你正经历怎样的阶段，现在绊倒你的，不过是一颗螺丝钉；你愁肠百转看不穿的，或许是他们也曾有过的迷茫。\r\n</p><p>在18岁—23岁那段时间，我很没出息地爱翻阅名人履历。每知晓一个佩服、羡慕嫉妒恨的人，便去搜寻他的经历——几岁硕士毕业？何时修完的博士？多大年龄开始在职业领域崭露头角？何时达到今日的成就？\r\n</p><p>年龄，年龄，年龄，那是一种对时间的焦虑。张爱玲一句“出名要趁早”，害了不知多少人。我反感成功学，因为显而易见，不是每个人努力都能成功，但我确信自己是幸运儿中的一个。我野心勃勃、精力充沛；我狂妄自大，对自己在外形和才华上的优势得意洋洋；我思考一切严肃的话题，阅读跟这个世界奥秘有关的书籍，向着古往今来浩瀚的文明致敬；我期待人们在出版物上阅读我的文字，在媒体上谈论我的名字；我向往声名、金钱、漂亮姑娘的长发，我反复阅读许知远《那些忧伤的年轻人》，为另一个同样骄傲的灵魂而心潮澎湃。\r\n</p><p>可我才20岁。\r\n</p><p>所有的名人书籍、讲座都告诉我，一个人要知道自己想要什么，才能做成事情。时至今日，无数同龄人的文章、微博里，在大受追捧的出版物里，还充斥着类似观点，甚至已成为带有反成功学意味、带有天然“正确性”的话语，大受“有独立思考能力”的思想青年认同。\r\n</p><p>但是，你问一个刚刚告别机械枯燥的高中生活，对世界和生活的认识刚起步的年轻人，他想要什么？他想要优异的成绩、同学间的声望、漂亮的女朋友，他还想要毕业后找到令人称羡的工作，尽快赚钱、成名、成功。\r\n</p><p>有人会问，这有问题吗？诚然，这也是“我想要什么”，但却只是模式化的流水生产线，试图把所有年轻人都打磨成一样的面孔。“想要什么”不应只关乎俗世的职业、功名，它应该切合更深层次的命题、人本身的挣扎和探索，即——我是谁？\r\n</p><p>你是谁？想拿遍大学里所有的奖学金，想过上物质丰裕的生活，想获得一个高薪的职位，想在北京四环内拥有一套自己的房子……Noooo……你是谁？\r\n</p><p>为什么那个愿意在一切可能的物体上涂涂画画的家伙，去做了一名公司职员，只因大家都说，自由画家的生活没有稳定保障？\r\n</p><p>为什么那个立志“铁肩担道义，妙手著文章”的姑娘，进入了国企，只因父母苦口婆心的劝，记者收入不如国企高？\r\n</p><p>你是谁？我是说，剥离掉一切外界赋予你的定位和枷锁，隔离开所有父母长辈试图左右你、干涉你的声音，忘掉全部大众传媒、明星名流以及出版物曾经输出给你的价值判断，你又是谁？你躯壳之内那个砰砰乱跳、嗡嗡作响的他、她、它，是谁？\r\n</p><p>世事多舛，你来何干？\r\n</p><p>20岁出头的年纪，不知道自己想要什么，不仅不是灾难，反而可能是一件幸事。\r\n</p><p>但你一定朦胧知道自己是谁，对什么事感兴趣吧？如果连这都不知道，就真的是灾难了。\r\n</p><p>知道对什么事感兴趣，就一点点做起来吧。无论多少声音试图扭转你，说你热爱、着迷的这件事情，没钱途、没前途、没发展、没出息，都请悠悠的对他（她）说：Fuck&nbsp;off，this&nbsp;is&nbsp;my&nbsp;own&nbsp;life.\r\n</p><p>不为什么，因为热爱。千金难买热爱。\r\n</p><p>我曾把几年来写过的一些文章发给丹青老师看。他很高兴，回信说，文辞再沉静一些就更好了，但就这么慢慢写起来吧。他没有说，你要在笔头功夫上多努力，他日成为著名的记者、作家。我懂他的意思：你喜欢这件事，就慢慢做吧。\r\n</p><p>去哪里，不重要。\r\n</p><h3>三、为什么要让人生“画地为牢”\r\n</h3><p>朋友问我，以后想做一个出色的记者吗？我说，不知道。他诧异，你不是混传媒圈吗？我亦诧异，为什么要在20岁出头的年纪给自己的人生下一个定义呢？定义即枷锁，即画地为牢。难道这个年纪，不应该是尽一切可能伸展自己的触角，去触摸不同的、多元的事物，感知并观察丰富、蕴藏无限可能性的世界么？\r\n</p><p>下了定义，即关上了可能性的大门。你怎知日后不会遇到更令自己好奇、亢奋的事情？你才20多岁，20多岁，20多岁。我为什么不能去做职业旅行家？为什么不能去做NGO？为什么不能在码了几年字后，突然迷上了摄影？为什么不？\r\n</p><p>阅读名人传记，好处是能藉由他者在人生关键时刻的抉择，参照自己的生活；而负面效果却可能更致命——“从小立志做一名……”。\r\n</p><p>若你回头梳理自己的人生履历，花些心思，会看到一条似乎清晰的轨迹和路线，进而“恍然大悟”：我正是循着这样的路一步步走来的，原来我从一开始就是想要成为这样的人啊。如果你写过申请学校的PS，可能有类似体验。但，这或许是欺骗性极强的“假象”——回望过去履历难免会总结、归类，拎出一条主线来并不困难。很可能，你从一开始并不是想成为这样的人，甚至并不知道自己要走怎样的路，只是迷迷糊糊的，循着兴趣走过来了。\r\n</p><p>是的，是兴趣，而不是规划——“从小立志做一名……”。\r\n</p><p>若日后我莫名其妙成了一名电游玩家，我在个人传记里也可以深情回顾“我从小就立志做一名职业电子游戏玩家”，因为我4岁开始玩电子游戏，至今仍不辍，算得上发烧友。\r\n</p><p>莫忘了，冯唐年轻时是个诗人、文艺青年，后来修了妇科博士，再后来做了咨询公司，现在又做了实业。\r\n</p><p>莫忘了，老罗直到27岁之前，还认为自己终生跟“老师”和“英语”这两个词绝缘。\r\n</p><p>我一直对“规划”二字持有戒备，所谓职业规划、人生规划，忽悠者众。\r\n</p><p>人生是靠感知的，如何规划呢？职业生涯是靠机遇和摸索的，如何设计呢？而规划如何成功，更是无稽之谈。丹青老师28岁登上去美国的飞机时，如何规划自己此生要成为对公共领域发言的学者名流呢？他只是喜欢画画，就画，一笔笔的画；秦晖老师15岁下乡插队时，认为自己这辈子就待农村了，如何“立志成为中国思想界的标杆”呢？他只是喜欢阅读，就读，一本本地读。\r\n</p><p>如果我四五十岁时有机会受邀到年轻人中去开个讲座，一定要叫做“我的人生无规划”；如果我混得灰头土脸，在世俗意义上是个无人问津的卢瑟呢？那我就跟自己的孙子吹吹牛逼讲讲“无规划之人生”中好玩儿的故事呗。\r\n</p><h3>四、谁也无权告诉你该怎么活\r\n</h3><p>如果你时常参加中国大陆的思想人文类沙龙，哦不，或就是普遍的名人讲座。在提问环节你几乎很难错过一个问题，“XX老师您好，请问您对当代年轻人有什么看法和建议？”\r\n</p><p>据一些讲演者众口一词抱怨，这几乎是最令他们反感、厌倦的问题。或许连提问者自己都很难意识到，这个愚蠢的问题潜藏着一个不易察觉的心理成因：请告诉我们如何才能像您一样成功、出人头地？\r\n</p><p>不然呢？如某位学者所言，一个年轻人恳请一个老东西教自己如何面对新鲜世界。荒唐吗？丹青老师说，爱干嘛就去干嘛，关我什么事？你们好不容易生在一个可以自由选择的时代，却还想让别人指导你该怎么活。\r\n</p><p>当真连自己喜欢做什么，该如何活都不知道么？想赢怕输罢了。该做些什么、走什么样的路，难道不是循着内心的声音一步步摸索、试错出来的吗？走岔了，就退回来；走得急，就缓一些。时不时停下来想想，望一望，琢磨琢磨，再继续走。\r\n</p><p>怎么可能不摔跟头呢？怎么可能诸事顺利呢？怎么可能有条一马平川叫做“成功”的路供你走呢？不多试错几个怎知自己跟什么样的人处得来呢？同理，不多尝试一些怎知自己喜欢什么不适合什么呢？\r\n</p><p>正如丹青老师给贾樟柯的书写序，“我们都得一步一步救自己，我靠的是一笔一笔地画画，贾樟柯靠的是一寸一寸的胶片。”\r\n</p><p>青年人的选择就如整个国家急功近利的写照，“先污染后治理”，先成功后成长，先找工作再找兴趣，先出人头地再寻找自我。某位职场中的朋友抱怨，自己在工作岗位上迷失了困惑了。不知自己到底适合这份工作吗？\r\n</p><p>我问，你到底喜欢做什么？他嚅喏半天，说不上来。\r\n</p><p>有的明确表示，我不喜欢自己的工作。那么我该去报个拉丁舞班吗？去报个吉他班吗？\r\n</p><p>从事并非自己志趣的职业问题并不大，业余时间发展偏好就是了。但我后来才醒悟，比“不能从事自己喜欢做的事”灾难性一百倍的，是压根“不知道自己喜欢做什么”。\r\n</p><p>黄律曾有条状态写道，“现在想想中国父母从小到大灌输的要一直读读读，抓紧把书读完最好读到博士，然后去工作实在是害死人，这样看起来是沉得下去的表现，其实越到后面就读得越浮躁。美国人这儿gap一年那儿gap一年，反倒更容易找到属于自己的生活。生活本来就是个沉淀的过程，急匆匆地往学位阶梯上爬干什么！”\r\n</p><p>这让我想起听来的一个故事。一个澳大利亚人，大学毕业后在半岛电视台做了三年记者，游历了欧洲，后跑去念了一个哲学一个经济学的硕士学位，又到非洲做了两年义工，等他跟我一个师姐成为名叫“人权”的硕士项目同学时，已经33岁了。我不解，他读完硕士为什么不继续读博士呢？“他在生活中发现一个新的兴趣点才跑来念一两年书，但这些兴趣的程度都没到博士那么深入，而博士研究的方向很可能是一生的志业”，师姐道。那他毕业后都35岁了，做什么呢？“他似乎还没确定”。\r\n</p><p>这似乎是一个不靠谱的反面典型。正如一些老同学对我的印象。他们一边说，羡慕你丰富多彩的生活，听完我近期打算又同情地啧啧叹道，那你留学回来都多大了？27岁。还读PHD吗？不知道。那你何时结婚？谁知道呢，30岁？也说不定念书的时候就闪婚了。你也太不靠谱了吧，我都副科了……那你留学回来能找一个多牛逼的工作？我说，出国未必是为了找到更好的工作，目前想从事的职业不出国留学也能做的。啊？那出国意义何在？\r\n</p><p>个人阅历、视野和自我完善。看看更大的世界，在自己身上发现更多的可能性。\r\n</p><p>这话我终究没说出口。\r\n</p><h3>五、你要的是快乐还是“成为大人物”\r\n</h3><p>有没有想过，自己这辈子终究只是个平庸的小人物，所有的梦想都没能实现？\r\n</p><p>我在南墙群里问大家。马老师说，不会的，说实话大家都是了不起的人，按照自己节奏一步步来，不会差的。\r\n</p><p>亦有友人问我。如果你终究只是个平庸的人，那些牛逼的梦想都没实现，世界也没改变丝毫，会快乐吗？\r\n</p><p>我问，温饱不愁吗？他说，那肯定，没这么惨啦。只是说，蛮普通的，可能只是一枚平平的记者编辑，在单位无甚出彩之处，月薪最高也就一万上下，交房供，养儿育女，开辆普通车。不痛苦，但也没什么光彩的生活。\r\n</p><p>家里空间是否足够让我挂幕布开投影仪踢实况？可以。\r\n</p><p>还喜欢足球，喜欢阅读，喜欢年轻时喜欢的一切东西？是的。\r\n</p><p>时而三五好友，烤串啤酒，把酒言欢；时而周六周日，球场相见？是的。快乐。\r\n</p><p>他看着我的眼睛。快乐。我点点头。\r\n</p><p>不久前去东北旅行，路途感触最深的莫过于导游、乘务员、售货员的差别。你会轻易的发现，性格将人与人彻底区别开来。\r\n</p><p>我们遇到过热情健谈、跟大家打成一片的导游，也遇到过黑着脸像客人欠她钱一样，没问两句就不耐烦的导游；遇到过如一切常见的公务人员般恶狠狠的乘务员，也遇到过穿着制服坐车厢里跟乘客扯淡逗乐的乘务员。\r\n</p><p>如果你是一名普通的导游、乘务员，你会如何对待你的客人？考虑到这是日后再也不会打交道的“一锤子买卖”，何况也很少有人真正有闲心去投诉你恶劣的服务态度。\r\n</p><p>考虑到，你完美的服务态度很可能无法给你带来任何实质性的好处，除了客人的一声感谢，一张笑脸。所在单位无法注意到你的“优良表现”，你表现好不会被升迁，表现差也很难被辞退——在中国，那个对客人态度恶劣屡遭投诉的可能反而讨领导喜欢，比你升迁更快。你懂的。\r\n</p><p>总而言之，你的服务态度无法对你的现实生活带来任何可见的好处，你此生都会是一名普通的导游、乘务员、售货员。你会如何做？\r\n</p><p>是的，或许你终生都只是一个平庸的人，但态度依然会带来生活质量的云泥之别。你热爱生活和工作，真诚的感知、理解、善待他人，或许未曾给你的生活带来任何有形的回报和改观，却软化了你与内心世界的边界。你不断接收到来自他者的正面回馈（感谢、笑脸、善意），再不断释放出正面能量，形成良性循环。\r\n</p><p>我很长一段时间都会记得那个导游、那名乘务员、那名售货员的热情、爽朗和笑脸。想起来都是暖意。\r\n</p><p>他们或许此生都是导游、乘务员、售货员，也很难有何升迁，但从他们的工作态度里，我读出了真正的快乐。\r\n</p><p>做一件喜欢的事难道不是做这件事最好的回报吗？正如写作是写作的回报，画画是画画的酬劳。\r\n</p><p>六、成长是一个时辰一个时辰熬出来的\r\n</p><p>我曾经很喜欢一个朋友的签名档，“成为更好的人”。\r\n</p><p>这句不疾不徐却又溢满坚定的话，曾无数次给我力量。\r\n</p><p>如今，我却感觉这句话充斥着“更高、更快、更强”的进步论腔调，在铺天盖地的励志话语中，我偏偏爱上了“毁志”。我更喜欢用“感知”这个词。或许我们并不能创造生活、规划人生，或许，体味、经历、感知、理解，这才是成长的密匙？\r\n</p><p>成为更好的人？如果今天陪母亲坐在太阳下聊了一下午天，漫无目的的，童年、成长、家庭琐事，有没有成为更好的人？如果今天没有读维特根斯坦的传记，没有跟近韩寒最新的博客，没有刷新微博，只是给自己做了一顿可口的饭菜，躺在恋人的臂弯里发呆，算不算荒废生命？\r\n</p><p>这一代中国年轻人可能面临着某种吊诡的自我矛盾，一方面，我们是前所未有早衰的一代，“十八岁开始苍老”，二十岁开始怀旧，尽管仍在青春，“你爱谈天我爱笑”的时光竟成了一代人的集体乡愁；另一方面，我们拼命的想要向前奔跑，想要稳定、无虑的生活，想要拥抱住某种确定感，焦虑着，想要立即像三四十岁的人那样，车房不缺，事业成功。\r\n</p><p>你，你，你，真的享受年轻吗？为何你一边怀旧一边还在努力奔跑？\r\n</p><p>你，你，你，真的热爱冒险和漂泊吗？为什么将理想纳给稳定和房产证做投名状？\r\n</p><p>你，你，你，真的珍惜可能性吗？为何我看到你宁肯早衰也要拥抱“生活的终结”？\r\n</p><p>生活更美好的可能性，难道不在于这缓缓经历的一步步、默默感知的一天天，而在于未来的宏大勾画？\r\n</p><p>结婚的，添子的，升副科级的，做小经理的，博士毕业的，买房买车的，走得好快。我曾经焦虑过，后来发现，那不是我的节奏。我是慢吞吞的一头牛。如果方向错了，就会兜大圈子，如果方向对了，就不怕慢。\r\n</p><p>一步步，一寸寸，一点点，一天天，慢慢来。\r\n</p><p>我不知道自己最终要去哪，还在一边晃悠一边张望，走一步停一下，摸摸这个碰碰那个，试图去感知、观察、理解这个世界。新鲜好奇着呢。但我确定，我只会走自己想走的林荫道；我确定，我会像哈维尔说的那样，遵从自己的内心，活在真实里。\r\n</p><p>2011年可能是有生以来最不顺利的一年，屡遭挫败，计划搁浅。回头望望它，再踮起脚尖往2012年瞅一瞅，我还是想慢吞吞的说，我们都要死很久，活那么急干嘛，慢慢来。\r\n</p><p>所有的成长和伟大，“如同中药和老火汤，都是一个时辰一个时辰熬出来的。”\r\n</p><p>七、人生不怕走得慢，就怕走错路\r\n</p><p>刚来美国时，总听到中国人说美国懒散，可以举出很多例子来。美国人每年一定会外出度假，至少也要到海滨，在沙滩上躺躺。\r\n</p><p>中国人想干事，干起来确实夜以继日。吃起苦来，也是举世无双，我常听到美国人说，中餐馆的人，工作真辛苦，一周上六天班，开餐馆的人甚至一天上七天班。美国餐馆，把一天的班分成午班与晚班两个班，一般服务员只上五个半天班。\r\n</p><p>可是，你真得与那些开餐馆的去聊一聊，他们都会告诉你，钱一但赚够，就再也不开餐馆了。\r\n</p><p>因为累，而生厌，生厌的东西，一是不能长久，二是不能有创新，成为一流。所以，中餐在美国是几乎快餐的代名词，而不是高档的标志。\r\n</p><p>美国人看来懒散，又会享乐，可是美国还是超强，而中国人劳劳碌碌，可中国还是个发展中国家，奥妙就在与此。\r\n</p><p>而且，国人虽然走的快，却常常走错路。美国人走的慢，却常常走对路。\r\n</p><p>走得快时，如果犯错误，损失就大了。五十年代，大炼钢铁之际，每家都把铁锅砸了去炼钢铁，其中有一年，钢铁产量几乎赶英超美了，可是，这样竭泽而鱼似的炼钢，后继乏力，后来灾难接踵而至。\r\n</p><p>慢得好处是，有足够时间评估结果，有错误就停下来。中国现在的经济高速增长，举国欢庆，可是，这不是没有隐忧，对环境的破坏也是惊人。环境污染有影响到人的健康，使医疗支出成倍增长，这侵蚀着人们生活品质。\r\n</p><p>中国人对自己的房子，每年都花精力维修，有些五十年的房子，还象新的一样。\r\n</p><p>苦干不如巧干，巧干都有计划，都擅长利用现有资源，而不是每次都市简单的另起炉灶。\r\n</p><p>贵在持之以恒。中国人知道这个道理，可是，在实践中做不到。\r\n</p><p>中国的学生，有些小学开始学中学内容，中学开始学大学内容，有些大学还有少年班，这些人的学习真是够快的。可是，为什么在诺贝尔的排行榜上，他们却迟迟无名？\r\n</p><p>关键就是，很多人跑得快，可是，却常常改变方向，没有恒心。很多大学生，一走出校门就不再学习了。而美国提倡的是终身学习。\r\n</p><p>再看经济学家。中国学生数学比美国学生强，而得诺贝尔奖的美国经济学家却比中国多得多，考虑到现代经济学用到很高深的数学知识，这匪夷所思。\r\n</p><p>可是，进一步的观察，发现这也是情理之中。美国的一些科学家，包含经济学家，却有很强的敬业精神。一辈子从事一个领域的研究，衣带渐宽终不悔。最后，月中折桂，并非偶然。\r\n</p><p>在技术领域，中国人用经营餐馆的方式来经营软件，很多程序员累得都想转行。很多经验的积累就白费了。殊为可惜。\r\n</p><p>所以，我想说，人生，只要方向对头，就不怕走的慢。慢一点，也许成功会来的晚一点，但更能保证成功的品质；慢一点，也许不会那么早到达终点，但亦不会因太累或太急躁而半途而废。你说呢？\r\n</p><p>八、最好的成长，就是过好当下每一刻\r\n</p><p>威廉•奥斯乐是一位名医，他越来越多地接触到因烦恼和忧虑而生病的人，他们总因为过于烦恼以前和忧虑未来，长期闷闷不乐，毁坏了健康。为了更彻底的医疗好这些人的病，他给他们开了一个简单却有效的方子：“每一个刹那都是唯一”，意思是说：我们活在今天，就只要做好今天的事就好了，无须担忧明天或后天的事；我们活在此刻，就要好好珍惜此刻的时光，每一个刹那都是唯一的，不复返的。\r\n</p><p>他说：“无限珍惜此刻和今天，还有什么事情值得我们去担心呢？每天只要活到就寝的时间就够了，往往不知抗拒烦恼的人总是英年早逝。”的确如此，每天都处于忧虑中，身体就像一根绳子般，拉来拉去，迟早会拉断。\r\n</p><p>……\r\n</p><p>过一天算一天，更多关注眼下的时光和日子，当我们把日子分成一小段一小段，所有的事都会变得容易的多。如果我们只活在每一个片刻，就没有时间后悔，没有时间担忧，而只专注在眼前。聪明的人一次只咀嚼生命的一小片段，因为这样才不会被噎到。\r\n</p><p>每一个当下都是独一无二的，它不是过去的延续，也不是一个接着一个线性的未来。时间是由无数个“当下”串联在一起的，每一瞬间、每一个当下都将是永恒。\r\n</p><p>所以，当我们吃的时候，要全然地吃，不管在吃什么：当我们玩乐的时候，要全然地玩乐，不管在玩什么；当我们爱上对方的时候，要全然地去爱，不计较过去，不算计未来，全然地投入。\r\n</p><p>就像《飘》的女主角郝思嘉一样，在烦恼的时刻总是对自己说，“现在我不要想这些，等明天再说，毕竟，明天又是新的一天。”昨天已过，明天尚未到来，想那么多干嘛，过好此刻才最真实，否则，此刻即将消失的时光，要上哪里找去？\r\n</p><p>我有个小亲戚，在读小学的时候，他的外祖母过世了。外祖母生前最疼爱他，小家伙无法排除自己的忧伤，每天茶不思饭不想，也没有心思学习，整天沉浸在痛苦之中。周围的人都说他是个懂感情的好孩子，他的父母却很着急，因为，一天两天的伤悲是正常，一周两周的伤悲也可以理解，但大半年都过去了，他还时时哭泣，不肯好好吃饭和学习，严重影响了他的成长。\r\n</p><p>爸爸妈妈不知道如何安慰他。正好一次我来到他们家，看到此情形，决定要和小男孩聊聊天。\r\n</p><p>“你为什么这么伤心呢？”我问他。\r\n</p><p>“因为外祖母永远不会回来了。”他回答。\r\n</p><p>“那你还知道什么永远不会回来了吗？”我问。\r\n</p><p>“嗯――不知道。还有什么永远不会回来呢？”他答不上来，反问着。\r\n</p><p>“所有时间里的事物，过去了就永远不会回来了。就像你的昨天过去，它就永远变成昨天，以后我们也无法再回到昨天弥补什么了；就像爸爸以前也和你一样小，如果在他这么小的童年时不愉快的玩耍，不牢牢打好学习基础，就再也无法回去重新来一回了；就像今天的太阳即将落下去，如果我们错过了今天的太阳，就再也找不回原来的了。”\r\n</p><p>他真是一个聪明的孩子，以后，每天放学回家，在家里的庭院里面看着太阳一寸一寸地沉到地平线以下，就知道一天真的过完了，虽然明天还会有新的太阳，但永远不会有今天的太阳，他懂得不再为过去的事情而沉溺，而是好好学习和生活，把握住现在的每一个瞬间。\r\n</p><p>每一天、每一小时、每一分钟都是特殊时刻，每一个刹那都是唯一的。因为，过去了就无法再回头。\r\n</p><p></p><p>人生，当下都是真，缘去即成幻。所以，我愿与所有的读者朋友共勉：眼前的每一刻，都要认真地活；每一件事，都要认真地做；每一个人，都要认真地对待，因为“缘去即成幻”，别让自己徒留“为时已晚”的遗恨。逝者不可追，来者犹可待，最珍贵、最需要珍惜的即是当下――生命的意义就是由这每一个唯一的刹那构成。</p><p><br></p>',	0,	'',	1,	1482422400,	1482506913,	0),
(4,	'0e89836c5df21940',	'大月亮和小星星',	'溯',	'大月亮和小星星的故事还在演绎着，小星星会永远陪伴大月亮，直到时间停止，直到宇宙覆灭，直到一切化为零点······',	'//static.newday.me/cms/image/bf4567030419c0317b506afb6ed6d027.jpg',	1,	',大月亮,小星星,',	'http://www.sanwen.net/subject/3886530/',	0,	'<p>今年，我十六岁。\r\n</p><p>我默默地等待着即将到来的十七岁，不禁感由心生，我已经在这个世界上生活了十七年，也陪着她度过了十七年的时间。不知从何时开始，我拿起笔头儿，在纸张上比划起了自己的幻想。\r\n</p><p>我的幻想，有山川，有河流，有仙境，有繁花，有飘絮，有一切我自认为美好的东西。长大了，脑子里的东西也变了很多，这几年里，我对写作的兴趣极大幅度地提升了，或许吧，青春期的小姑娘总是有很多想要抒发的，然而我没有太多朋友，就只能写在自己的小本子上。\r\n</p><p>我写天，我写地，我写空洞离奇的生命，我写不值一提的爱情，实在是写了太多自己的东西，回头一看，为她写的却寥寥无几，于是，我决定，在这个寒冷却温暖，凄清却和乐，空旷却拥挤的雪夜，写一写我俩——我和我不寻常的妈妈。\r\n</p><p>外祖父是旧时的知识分子，他为妈妈起了一个朦胧并刚毅的名字，仅仅两字，却足够成为一首诗，一声叹，一幅画：在孟夏之夜，清风如少妇的思绪般轻柔，流水似老翁的鼾声般悠闲，唯有天上的一轮明月，将这静谧的一切打破，明月把希望之光送进了溪水旁边的小竹林，纯美的月色和韧性的竹子一同诠释着惊艳，竟衍生出一种凛然的坚毅，竟幻化出一曲脱俗的筝乐。这就是妈妈的名字，无法太简单，无法太复杂，确实在太美，和她一样。\r\n</p><p>我呢，名字很简单的，单一个“烁”字，闪烁的东西可以是萤虫，可以是渔火，可以是电灯，可以是烟花，可以是双眸，但我只想让它是星星，因为，妈妈是月亮啊！</p><p>我是星星，却是一颗精致的小的星星，妈妈是月亮，却是一轮耀眼的大月亮。夜空中，我和妈妈绝对是最可爱又奇妙的组合。\r\n</p><p>虽然妈妈性格顽强，但是自从我出生，她就一直在为我操心。\r\n</p><p>（一）\r\n</p><p>最气人的，当属我那两段因情窦而初开引起的早恋。上了高一，学业负担一点都不比初三轻，我过着忙碌又循环的生活，每天穿一样的校服，每天学一样的科目，每天看一样的面孔，这颗饥渴的心早就想要“突围”了。就在一天晚上，我依然是在社交工具上寻找聊天的人，枯燥乏味，却又无法挣脱。这是，我竟然遇见了一位“兵哥哥”，顿时，我双眼发出花痴的光芒，一直以来，“兵哥哥”这个形象在我的心里就像一座高大的山峰，我崇敬着他们，我欣赏着他们，我觉得，只要是个男性穿上那身军装都会散发出令人乍舌的气概，于是，我带着这种愚蠢的价值观和他结识、交谈、相处，甚至恋爱。每天晚上我都会借搜索问题的幌子使用妈妈的智能手机，然后，老老实实的坐在房间里，又要提防妈妈的乍到，眼巴巴的看着手机屏幕，等待“兵哥哥”上线，然后，就是甜蜜又惶恐的一夜。这样的日子，持续了将近两个月。\r\n</p><p>直到有一天，我毫无防备的聊着，妈妈忽然推门而入，房间里的甜蜜顿时变异成一种可怕的压抑。“你干什么呢？”“我，我没，没干什么呀。”“把手机给我看看。”我脑子里仿佛爆炸了一颗威力巨大的氢弹，“不。”我起身离开了她的视线，边走边操作着下线的步骤，手心里急得全都是冷汗，我像是一只撞见老虎的兔子一样，浑身发抖，仿佛罪不容诛。然后把手机塞到了她手里，自己走开了。“我告诉你，你要是有事最好不要让我撞见。”妈妈没有多说一句，而是面无表情的回到了自己的房间。我坐在沙发上，双眼发直，脑子一热，冲进了妈妈的房间。“我用一下电脑，处理一下情感问题。”她目瞪口呆，却丝毫不见愤怒，“你还真的有事啊！”妈妈离开了房间，而我，真的和那个“兵哥哥”分手了。\r\n</p><p>没过几个月，我便吃了回头草，和“兵哥哥”又联系上了，并重新开始了含情脉脉的生活。我依然是提心吊胆的过日子，而我英明的妈妈又发现了我的拙举。\r\n</p><p>“我能受得了你的所有不，唯独受不了你骗我。”我无言。“为什么说好了分手还和人家不清不白？一个女生为什么就是不懂得矜持？”我无言。“你知道我这些日子怎么过的吗？我在背后哭了多少次你知道吗？”我依旧无言。这一次，我彻底和“兵哥哥”分得干净了。之后就是长达两个星期的相对无语，我不是生她的气，而是无法直面她——为我操碎了心的妈妈。\r\n</p><p>过了将近一年，兵哥哥又和我联系，我因心太软，和他做了朋友，给他发了一张近况的照片，没想到，他的举动竟让我无比心寒。在从学校放假回来的那个下午，妈妈一脸愁容的坐在沙发上，这个表情，我似曾相识。“我问你，你和那个当兵的是不是还有联系？”我心如万雷轰顶，就在那一秒钟，脑子里闪出无限的心惊：“我联系啊，但是我可没跟他处对象啊？这要怎么办？我是清白的，但搞不搞对象那都是联系的范畴啊？这叫我如何是好啊？我要怎么回答啊？。”下一秒，我便开了窍使用了大招——装傻。“我没有啊。”“那今天上有个男的打电话来了，南方口音，还知道你的名字，是怎么回事？”“什么情况？我不知道啊？”之后便是我的一脸无辜，和满嘴的无知，搪塞了这件乱事，将近持续半个小时的时间，我已经没有战斗力了，便跑去给好闺蜜大轩打电话出去玩。夺门而出的那一刹那，我仿佛从门缝里看见了她的愁容，我的心里也很不好受。\r\n</p><p>我去网吧处理，却没处理明白，便和大轩在外面倾谈了一会，然后回家解决。“妈妈，大轩来了！”妈妈竟然不见了愁容，而是无比温婉慈祥的脸色，我感到无比的惊异，或许吧，妈妈就是这样一个人，不会把一切都写在脸上，为了我。我打开了电脑，借着和大轩一起玩电脑的名义，上了线，把当兵的臭骂一通，然后删了他。最后，这团麻线就这样捋直了，妈妈暂时结束了对我早恋的操心。但直到现在，这段所谓的感情让我想想都感到后怕。\r\n</p><p>我真佩服以往的自己，小小年纪，也算年轻有为，还没二十呢就处了两个对象，怪我太感性？\r\n</p><p>上一个“兵哥哥”不算初恋，这一段，却算是真正的初恋。\r\n</p><p>他是我第一个喜欢上的男生，从小学就开始喜欢了，当时不知道这是喜欢的感觉，直到有一天，我们就这样“相遇”了。寒假漫长，和堂妹一起浪费时间做没有用处的事，然后依然是寂寞难忍。那天夜里，我在社交软件上和他重逢，第二天决定去约会。我人生的第一次约会，就在腊八那天，寒冷却又太温暖。妈妈，我又骗了你一次，其实我就是一个骗子，一个不顾及你心绪的骗子，是世界上最讨厌的骗子。\r\n</p><p>青春期的爱是什么呢？就是橡皮糖一样难舍难分，就像烧开的沸水一样太过冲动，可怜的誓言只是暂时维持爱情的保鲜剂，最后，有谁在一起了？但是，靠别人说一百次，也不及自己经历一次，和他的爱断断续续，持续了半年。在期间分手的时间，我和妈妈坦白了一切，没想到啊，妈妈的慈爱让我感动了，她和其他家长不一样，他并没有严厉地斥责我，而是选择了像个小女生一样倾听我的心声，虽然当时没有被震撼，但现在想来，他真的是太不容易了。然而又在一天夜里，妈妈的手机里竟然出现了他的照片，或者是我保存到手机忘了删吧。我如凉水盖头，心里别提多忐忑了，但是，这一次，我又骗了她，我又骗了最爱我的妈妈。“这是谁啊？”我先是停顿了一会，心里火急火燎地想着怎么回答，最后，我用自己的急中生智又搪塞了过去，还假惺惺的流下泪来，装作委屈。但是啊，这一次，我真的是无法在继续我的早恋了。妈妈是个单纯的人，而我却用眼泪和谎言骗了她，然后又换来了她的无限自责，其实啊，我却是自责而哭的，我一遍想着搪塞，一遍又自责，眼泪顺流而下，竟是那么的真实自然，世界上最讨厌的骗子就这样又提升了自己的等级，成为了宇宙最强的骗子，因为，她竟然连自己的妈妈都不放过······\r\n</p><p>第二天中午，我又撒了谎，这一次，不是对妈妈，而是对他。以前和他分后都会很心痛，而这一次，我确实如此的坚定。因为我的心里有一个强烈又忧郁的声音，不能让妈妈再操心了，否则我将没脸做她的女儿，对不起，我心爱的初恋，如果上天让我选择你和妈妈，我一定会毫不犹豫地选择妈妈。于是，我又施展自己的“骗人大法”，谎称自己的社交号码和妈妈的关联了，最近无法和他联系了，先删了我。而他，一句话一没多说，马上就删了我。\r\n</p><p>就这样，直到现在，我也没和他联系，当一个负心人真的很煎熬，但是，当一个不孝女却是生不如死的。我的早恋，就这样结束了，不留痕迹的结束了，为了妈妈结束了。妈妈，对不起，让你操心了。\r\n</p><p>（二）\r\n</p><p>还是怀念小时候的日子，那时候，没有为了求学来到城里，乡下的生活像童话一般淳朴自然，有田野，有蓝天，有花鸟，有伙伴，有幻想，有个子比我高的妈妈······\r\n</p><p>有一个画面，十年了，在我脑海里仍然挥之不去。\r\n</p><p>妈妈骑着自行车，我侧着身子坐在车后座上，紧紧地搂着妈妈，我早已忘了那是在去哪里的路上了，只记得当车子驶过乡政府门前时，院子里的几株丁香花伸出墙来，在这个仅有我和妈妈的世界里增添了许多奇幻的紫色，幽郁的花香飘进了我稚嫩的鼻子，“妈，你闻到了吗？”“闻到了，真香。”那几抹紫色虽然在当时只停留了几秒钟，但在记忆里却是永恒的纯美，或许有一天，我被人间的尘俗捶打地颓废，但是，只要我再想起它，想起那曾停留在世界上的一霎那，想起那人间的至纯之景，想到那个行驶的自行车，想起那个美丽的妈妈，那个无比稚嫩的我，那几株优雅的丁香花，或许吧，不，是一定，我的灵魂会迎来二次重生，我会在世界的美妙中，妈妈的怀抱里重生，然后继续流浪在我的心海，朝着自己向往的方向流浪，带着儿时的美好流浪，带着妈妈的宠爱流浪，一直流浪······\r\n</p><p>妈妈，妈妈，我忘不了，你的女儿如何都忘不了啊，那些叫做童年的画面······\r\n</p><p>你拿扫帚清扫着院落，我在你的身后欢乐地背着乘法口诀；你在深夜里点着灯写着教案，我在你的身后崇拜地看着你那娟秀的字迹；你拿着锅铲做着菜，我在你身后乖巧地闻着饭香；你和爸爸激烈地争吵，我在你身后因心疼你却又因什么都帮不了而悄悄流泪；你对镜梳理着长长的头发，我在你身后羡慕的笑着；你牵着我走在回家的路上，我在你身后看着渐渐淡了的夕阳······\r\n</p><p>还记得那个开学前夜，昏黄的灯光下，我和妈妈一起补着我的暑假作业，忙活的不可开交，虽然小学时候，妈妈就是我的班主任，但是她仍然不允许我不完成作业，而是每一道作业都细心地为我讲解，时间很晚了，我大了许多哈欠淌了许多眼泪，妈妈也疲惫着打瞌睡，却始终没有放弃，钟表上的时间已经过了十一点，我和妈妈完成了大部分作业，因为分量太多，实在是没有办法一下个晚上所有的作业，但是那天晚上，我却睡的很实，躺在妈妈的臂弯里，所以惶恐都已经不见了，有的只是甜美的梦境，和妈妈给的充实的满足感。\r\n</p><p>那次阑尾炎手术，也折磨了妈妈。\r\n</p><p>那一年，我十岁，总是在吃饭后就马上跑去和小伙伴们疯玩，于是，便自作自受，患上了阑尾炎。我看着自己被推进手术室，手脚都被固定住了，心里害怕的不能言说，做一个比喻吧，就像是一一只被绳子捆绑着，等待着被放血的小年猪。手术开始了，我看着主导大夫拿着笔标记出了那颗坏死阑尾的位置，然后，惊险的一幕发生了，那种疼痛，或许是我活这么大最痛的一次。大夫把麻醉针直接扎入了我的小肚子，局部麻醉的疼痛让我惊吼一声“啊——啊”整个医院都震颤了，而手术室外的三人，妈妈，爸爸，妈妈的同事，他们也被惊吓到了。听妈妈说，爸爸跑去楼下哭，妈妈和她的同事坐在一起哭，我这一声吼，或许，强劲地击碎了妈妈的心，她心疼她的女儿，却又无能为力，我相信，这对任何一位母亲来说都是无比痛苦的。\r\n</p><p>手术之后，我被推了出来，伤口还隐隐作痛，到了夜里，麻醉剂的劲过了之后，竟然那么疼，我一边流着泪，一边躺在妈妈的腿上，仿佛那就是我最安全的依偎处。我不记得自己是何时睡着的，只记得那个温度，持续了一个晚上，她一动没动，就这样过了一个晚上，第二天，她的腿已经麻地很难受了，但是妈妈并没有说一个字。\r\n</p><p>妈妈对不起，让你操心了。\r\n</p><p>而现在······\r\n</p><p>我知道，妈妈，你的女儿太冷漠了，她只会索取，而不懂得回报，让你伤透了心。\r\n</p><p>我知道，妈妈，你的女儿太自私了，她只想着自己，而不会关心你，让你流了许多泪。\r\n</p><p>我知道，妈妈，你的女儿太任性了，她孤僻却又不羁，从来都听不进去你的任何一句话，让你频增了许多白发。\r\n</p><p>妈妈，再过一年我就要离你而去了，我就要远离家乡去求学，我会开始自己的人生，我会选择山水，我会选择梦想，我会选择天涯海角，虽然不是生离死别，但是能抵足而眠的日子真的不多了。\r\n</p><p>让星星拥抱月亮吧，将整片夜空点亮。\r\n</p><p>有的时候，许多后悔就在一念之间产生，日后甚至会变换成为终生的遗憾，尽管美丽的世界已经在眼前，尽管已经得到了为之拼搏的一切，尽管梦想已经是口袋里的一个破旧的五角硬币，尽管不再有幻想，尽管不再有纯真，但是，回一回头，你会发现，以前很多美好的东西，比现在拥有的一切都要神圣的多，神圣得足够洗涤无数的灵魂，释放无数的幽怨，而对于我来说，以往的神圣，都是妈妈给我的，我不能离开妈妈，就像星星离不开月亮。\r\n</p><p>妈妈，对不起，让你操心了。\r\n</p><p>你的女儿很爱你，大月亮和小星星的故事是说不完的，我相信，这会是一片最美丽的夜空，我俩的夜空。\r\n</p><p>无论如何，这篇文章是不能给你看的，不想让你再伤心了，无论那是烦闷还是感动，女儿都不想让你伤心。夜空上，若大月亮失去了光辉，那么小星星的存在也就不会那么精致可爱，一切都会少了一点趣味。\r\n</p><p>大月亮和小星星的故事还在演绎着，小星星会永远陪伴大月亮，直到时间停止，直到宇宙覆灭，直到一切化为零点······</p><p><br></p>',	0,	'',	1,	1482422400,	1482549958,	0),
(5,	'b05bc9e1554667fb',	'最美的不是下雨天',	'唯心独舞',	'最美的不是下雨天，而是与你一起躲过雨的屋檐。然后看懂云的形状。世界会等我，它问我冬天过去了没。',	'//static.newday.me/cms/image/994ce6898ed231e8c281763b3521e08e.jpg',	1,	',下雨天,',	'http://www.sanwen8.cn/subject/123634/',	0,	'<p>自己都不记得有多久没写过日志。不像以前那么的热衷于飘零在文字里。觉得无比轻快。就像那时和她说过，我们生活的每一个时间里，就如抛物线的每一个点，有着不同的速度。没有人会教我们怎么走，或许我们能做的，就是一路摸黑前行。我曾却想选择与某个人相偎相依。没有静静淋过雨的人，是不会知道心灵的深处在哪里。心灵的失落或许已经被雨水洗净了吧。\r\n</p><h3>别人的故事，自己的眼泪\r\n</h3><p>是有过那么一段时间啊！自己会无比侵淫在别人的故事里，会去写，会去想。会带着一点点的感怀。觉得自己可以在里面学到些关于爱的种种。也直到至今都会问自己，学到了什么。那份执着给自己带来了什么。还记得那次说到那位老哥，他也是一位如此执着的男人啊。最后我问他，最后为什么还要分开。他没有回答。现在想，或许他的答案，说好两个人一起走今后的路，可当其中一个人走不下去，不想走了。那这条路，可能再怎么样也没有了。人总要等到退无可退，才会明白自己曾经觉得没有多在乎，多珍惜的东西，在走今后的路，就再也遇不上了。\r\n</p><h3>我愿化身石桥\r\n</h3><p>那几天是和她争吵不休。觉得脑海里什么事物都接受不了，惟独剑雨里的那句台词却深深吸引着自己。阿难道，我愿化身石桥，受那五百年风吹，五百年日晒，五百年雨淋。只求心爱的人从桥上走过。后来闲瑕去查看这个佛家故事。原来其实故事的结尾是：当阿难已经等了两个五百年，佛祖问他，你已经等了一千年，只要再等五百年，就可以见到她了。他想了想，就告诉佛祖说，我不等了。佛祖突然欣慰的一笑，阿难就问佛祖为何笑，佛祖说，有一个人为了要见你一次，已经等了两千年了。她终于不用再等了。五百年风吹，五百年日晒，五百年雨淋。当选择去等待的时候，谁能真的想过自己的身后有着几千年的另一份等待\r\n</p><h3>得不到的永远不介意\r\n</h3><p>她说，当彼此分隔两地的时候，她有不少的追求者。于是我告诉她，大家都是男人，他们想什么我清楚的很。她会说，普通朋友也好。那一刻，无论精神抑或身体上，积压了好久好久的疲惫一下子涌出。是啊，或许光爱护她本身还不够吧！还要爱护她的所喜所想。谁能不累呢？真的只想让她明白，那些人喜欢上了，即使你有另一半了或是什么过去了他都不会介意，等他真的得到你了，他什么都会介意。男人的心思，你不懂。就像你不懂我的心思。不懂这个唯一不介意你所有的男人。甚至有时应该开始矛盾，下定那么大的决心是否值得。会突然的，去怀念那个已经等了两千年的人。\r\n</p><h3>男人不能说不行\r\n</h3><p>其实第一次听到这话时。比你跟我讲的时候早的多。记得是那时和刘杰第一次喝酒。那时的我已经晕头转向了，他傻瓜似的大骂，男人不能说不行。当时听了立马胸膛一挺，来者不拒。可当自己心力有些憔悴，想靠着这幅肩膀休息。却再次听到你说这句话，也不去追究你从哪学的。只是久违的勇气没来。有的只是心凉。但，没错呀！男人不能说不行，他行。他肯定能行。即使是从她口中讲出了，男人依旧不能说不行。\r\n</p><h3>每个人都有他的脾气\r\n</h3><p>是有听她讲过。两个人的脾气和性格想冲。是总得有一个人要会谦让，有一个做主。没那么简单，每个人都有他的脾气。是呀！她不会知道，这天底下真的没有真正做主的女人，有的只是被自己男人爱护的女人。如果用那份两千年的等待换来的是这样的卑微。是不是该重新审视它的意义了。或许它真的就没有意义。闭目回想，当初当它降临的时候，不也是不明白没道理嘛。为什么到后来，好多人总会去找它的意义或是价值所在。我想，它的本质，本是如此的呀！\r\n</p><h4>假如我们不曾相遇\r\n</h4><p>假如我们不曾相遇，不知道会停留在哪一座城市，哪一座县城，哪一座小镇。过着怎样的生活，发生怎样的故事。人生不是你想得那样简单，生活也不是你想得那样如此不堪。故事就是这样平凡。但是我还是对你说声谢谢。这一路有你相伴。假如我们不曾相遇，时间是否会停止在这相遇的瞬间，不旋转不摇摆。沉浸在这一片花海千山万水之间，左右徘徊带着一丝浪漫。等着奇迹的出现！\r\n</p><h4>最美的不是下雨天\r\n</h4><p>那是在一场春雨里洗过的太阳，我在淋过一场大雨之后的晴朗。雨后的天上，彩虹出现，衬出一片蓝天。每个冬季带来的失落，每个呼吸都是新的芬芳。爱在夏天过完之后锁在秋天。爱过冬天之后的我好了一些。最美的不是下雨天，而是与你一起躲过雨的屋檐。然后看懂云的形状。世界会等我，它问我冬天过去了没。</p><p><br></p>',	0,	'',	1,	1482422400,	1482553491,	0),
(6,	'fe3fef7055fd9215',	'如诗如画纳木错，只愿更多的人喜欢这里',	'遇上音阶',	'可以说，纳木错的四季是生命的四季，是永远花开烂漫的四季。',	'//static.newday.me/cms/image/39a32aaf254b7d6d188e1437cd77e7fb.jpg',	3,	',纳木错,',	'http://www.jianshu.com/p/1fba432711c3',	0,	'<p>纳木错湖的北侧依偎着和缓连绵的高原丘陵，广阔的班戈草原绕湖四周，天湖像一面巨大宝镜，镶嵌在藏北的草原上。湛蓝的天、碧蓝色的湖、白雪、绿草、牧民的牛毛帐篷及五颜六色的山花交相辉映，组成一幅大自然美丽、动人的画面，身临其境，无不感到心旷神怡。北岸的湖滨更分布着像扎西岛一样的美丽岛屿与众多宗教遗迹与圣地，那里生机勃勃，意趣盎然。那里有着独特的人文风情。可以说，纳木错的四季是生命的四季，是永远花开烂漫的四季。</p><p align=\"left\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-036c386efa6ea926.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>纳木错，西藏第二大湖泊，纳木措藏语为\"天湖\"的意思．藏名全称为“纳木措普摩”，意为富裕天湖。是西藏的\"三大圣湖\" 之一。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-a0416d7fa24bd80c.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>公元十二世纪末，藏传佛教达隆嘎举派创始人达隆塘巴扎西贝等高僧，曾到湖上修习密宗要法，并始创羊年环绕纳木灵湖之举。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-c30af6b8d34c82b5.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>信徒传说，每到羊年的时候，诸佛、菩萨、护法神集会在纳木湖设坛大兴法会，如人此时前往朝拜，转湖念经一次，胜过平时朝礼转湖念经十万次，其福无量。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-578faa113cfc715f.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>作为有生命的神湖，它的属相是羊。所以每到藏历羊年僧俗信徒不惜长途跋涉，前往转湖。这一活动在四月十五达到高潮。纳木措湖畔玛尼堆遍布。如有教徒经过这里，总会投下一颗石子。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-d9d1e76da47888ef.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>相传“纳木措是帝释天的女儿，念青唐古拉的妻子”。它们的造像分别为：念青唐古拉——头戴盔甲、右手举着马鞭、左手拿着念珠，骑白马；纳木措——腾云驾雾地骑着飞龙、右手持龙头禅杖、左手拿佛镜。念青唐古拉山在北方诸神灵中最具权威，它拥有广大无边的北方疆域和丰富的财宝。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-304cca9942d11673.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>传说中，纳木错和念青唐古拉山是一对生死相依的恋人，唐古拉山用其一尘不染的雪水滋润着自己的妻子，妻子纳木错将点滴雪水汇聚，孕育无数生命。他们就这样，相伴千年。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-5fa39f55584787d4.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>岸边的合掌石也称为父母石。相传它是念青唐古拉山和纳木措女神的化身，象征他们忠贞不渝的爱情。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-9a19d1a9a1617ec0.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>他们的爱有多深？屹立于天地，耸立于苍穹的唐古拉高度，深邃湛蓝的湖水的深度似乎就是一种答案。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-abf6b48e6277b9dc.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>每个到过纳木错的人，整个灵魂都仿佛被纯净的湖水所洗涤。站在纳木错湖边，这世界上最高最美的神湖让人震撼，仿佛置身于一个蓝色的世界。淡蓝、浅蓝、灰蓝、宝蓝、深蓝以及深邃如墨一样的蓝黑，这由浅而深的蓝色，蓝得清澈，蓝得丰润，蓝得迷人，似乎包容了世界上一切的蓝色。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-4b40d0cf7ea357d5.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>头顶深邃而疏朗的蓝天，与纯净的湖水浑然一体；远处雄奇皑皑的雪峰犹如琼楼玉宇，忽隐忽现；湖边的草地犹如一张巨大的绿毯，无边无际。清晨，湖面雾霭茫茫，太阳升起云消雾散，浩瀚无际的湖面在清风中泛起涟漪。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-1ad2209724bf896c.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>在阳光下，念青唐古拉山的主峰格外清淅，如一个威武的战士守护着纳木错。高原的气候常常瞬息万变，时而狂风大作，时而乌云密布，风雪过后，湖面依然波光粼粼，透着一种别样情韵。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-a195f446c63f7cd5.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>佛教徒们传说湖中兀立于碧波之中的五个岛屿是五方佛的化身，凡去神湖朝佛敬香的人，莫不虔诚顶礼膜拜。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-4bd3aa63f7c02174.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>心中的爱有多深，面对纳木错时，这里的湖水便有多深；心里的爱有多么纯粹，这里的湖水便有多么湛蓝。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-8a1c05ecb37ef398.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>见过夏季那令人心醉的蓝色纳木错的人很多，而千里冰封的纳木错却少有人烟，唯有湖边修行的僧人懂得纳木错的寂寞。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-36d6b35ea94679c0.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>纳木错的清寂伴着永恒的日出日落，纳木错的柔情连着苍莽的藏北大地，纳木错属于神。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-f0158aca7e7c06ef.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>它的明净与辽阔，无愧于天湖美称。然而，它的色彩多变却是蓝天所远不及的。时而碧蓝，时而苍翠，时而蓝绿相间，时而暗灰如晦，它还有个蒙语名叫“腾格里海”，又听人说它实际上是个内陆海，有受制于月亮而潮涨潮落的现象。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-44196b6eac9f2511.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>它的东南部是直插云宵，终年积雪的念青唐古拉山的主峰，北侧倚偎着和缓连绵的高原丘陵，广阔的草原绕湖四周，天湖象一面巨大宝镜，镶嵌在藏北的草原上。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-f352569fa8e2e873.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>湛蓝的天、碧蓝色的湖、白雪、绿草、牧民的牛毛帐篷及五颜六色的山花，交相辉映，组成一幅大自然美丽、动人的画面，身临其境，无不感到心旷神怡。</p><p align=\"center\" style=\"text-align: left;\"><img src=\"http://upload-images.jianshu.io/upload_images/1210365-3aa18b691b13a43b.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"clicked\"><br></p><p>在西藏，纳木错是一个无人不晓的名字。她是世界海拔最高的湖泊，更是藏民族心中最圣洁的“神湖”。仙境般的美景和神奇的传说吸引了无数的朝湖人、旅游者和探险家从四面八方涌来，年复一年，从未停止过。</p><p><br><br></p><p>文／别人的世界（简书作者）</p><p><br></p><p>原文链接：http://www.jianshu.com/p/9dfb8fc2926c</p><p><br></p><p>著作权归作者所有，转载请联系作者获得授权，并标注“简书作者”。</p><p><br></p>',	0,	'',	1,	1482508800,	1482559106,	0),
(7,	'5573400048a3febf',	'误解了这么多年，是时候为程序员正名了',	'千里马君',	'一切强加给程序员的标签，咱们都应当表示不接受、不承认、不赞同。',	'//static.newday.me/cms/image/be63d8121ba39b1b9b62ed2f155de410.jpg',	2,	',程序员,',	'http://www.jianshu.com/p/d89eff020222',	0,	'<p>说起程序员，除了高薪之外，总是会和屌丝、木讷、拖沓联系在一起。黑程序员的段子也如滔滔江水，连绵不绝。</p><p>下面这些黑段子，大家肯定不会陌生。</p><p>“都30了还没对象，你是程序员吧~”（不要伤及无辜好嘛~）</p><p>“写字楼里写字间，写字间里程序员;程序人员写程序，又拿程序换酒钱。酒醒只在网上坐，酒醉还来网下眠;酒醉酒醒日复日，网上网下年复年。但愿老死电脑间，不愿鞠躬老板前;奔驰宝马贵者趣，公交自行程序员。别人笑我忒疯癫，我笑自己命太贱;不见满街漂亮妹，哪个归得程序员。”（哟，写这首打油诗的哥们，估计怀才不遇，才华无用武之地了吧~）</p><p>“你们用盗版的时候有想过做出这款软件的程序员吗？！他们该如何养家糊口？”“哈哈哈，别逗了，程序员哪有家要养啊！”（说第二句的哥们，你过来，保证不打你~）</p><p>还有图片版的：</p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-2a82685559e65649.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\"><br></p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-b93300458736ed89.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\"><br></p><p>总结起来，大家对程序员的印象就是：木讷、内向、沉闷、拖沓、不懂浪漫、不善于交际</p><p>屌丝、苦逼、裤衩、拖鞋...</p><p>修电脑的...</p><p>用图片来形容就是像这样的：</p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-23d6e8d5237a178f.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\"><br></p><p>还有说像这样的</p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-e92d83d0d8d3fd4c.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\"><br></p><p>更有甚者，认为像这样的</p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-d70e45359e950b04.jpeg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\"><br></p><p>可事实真的如此吗？</p><p>小编长期和程序员打交道，阅猿无数，而且还偷学了一招半式，说起HTML、CSS、PHP啥的，也是知（yi）之（zhi）甚（ban）详(jie)。PHP不就是pai huang pian 吗，对吧？</p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-022e830611aad8b3.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\"><br></p><p>总之，小编算（zi）是（cheng）半个程序员，知程序猿者，莫过小编也~</p><p>经过小编多年的接触和观察，发现程序员是被误解了。程序员并非外界所说的那样“屌丝”。反而，他们是一个可爱的群体。</p><p>何出此言？且看小编追本溯源，以正视听。</p><p>首先我们来分析是什么原因造成了这样的误解。</p><p>小编认为，主要有以下四个方面：</p><h5>不了解程序员的工作</h5><p>这部分人对程序员的误解主要集中在工作职能上。他们认为程序员的工作就是修电脑。</p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-988d10b7116674b5.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\" class=\"\"><br></p><p>他们对互联网了解的不多，很多有关互联网知识都是道听途说。在他们的世界里，只要是从事与电脑有关的工作，都能和修电脑联系在一起。除此之外，他们也不知道程序员可以对电脑做什么。这和你在银行工作，总有人认为你很有钱，可以给他们贷款一个道理。代表群体为互联网欠发达地区，受教育程度不高的一类人，比如七大姑八大姨等等。</p><h5>管中窥豹，以偏概全</h5><p>这部分人对程序员的误解主要集中在性格和外在形象上。他们认为程序员的性格都比较内向，不善交际；每天裤衩、拖鞋、不休边幅...</p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-e447e39fcb26689d.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\"><br></p><p>他们熟知程序员的工作内容，且近距离接触，或为朋友，或为同事。在接触过程中，程序员的言行逐渐形成了他们所认为的形象，接触久了，形象就固定了下来，以为大部分程序员都是这样的。以后他们在谈到程序员的时候，就会联想到他们接触到的程序员，脱口而出的便是之前形成的固有印象，实则是某一小撮程序员的形象，并不能代表大部分程序员。代表群体为互联网领域非程序员工作者。</p><p>而事实上大部分程序员的性格并不内向，只是因工作性质的原因，他们没有多少空余时间和人谈天说地或者他们就不喜欢闲谈。与其闲谈不如写几行代码，这是他们的逻辑。</p><p>在外形这事上，说程序员邋遢、不休边幅，每天裤衩、拖鞋，程序员更是比较冤，这是个人生活习惯问题，与职业无关。如果一个人不注重生活习惯，那他换到其他行业也一样。</p><p>在穿着方面，他们追求极简、低调，够穿就行。相对穿着，他们在改善工作设备上确实大方很多，比如一台一万好几的mac book pro，上千块的炫酷机械键盘，只要工作需要，他们说买就买，毫不吝啬。</p><h5>受网络影响</h5><p>不得不说网络的力量是无穷大的。网络中充斥着大量黑程序员的段子和新闻，很多人根本就没有接触过程序员，但是看了这些段子后，就会不加辨别的吸收，形成了程序员在他们心中的最初形象，先入为主说的就是这个道理。代表群体为熟悉网络，辨别能力低，容易丛众的普通网民。</p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-693508652de6686a.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\"><br></p><h5>程序员的自黑</h5><p>自黑既是一种境界，也是一种沟通方式。在娱乐圈比较常见，在程序员圈也能经常看到程序员们通过自黑来缓解工作压力和表达一种工作状态，这也是他们的一种独特的幽默方式。 但某些吃瓜群众信以为真，误会就再所难免。</p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-53e4fb499650fd50.jpeg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\"><br></p><p>多重误会叠加，日复一日，年复一年，程序员就这样被“屌丝”化了。于是经常成为被调侃的对象。</p><p>其实真实的程序员除了众所周知的高薪外，他们还有很多值得大家敬佩和学习的优点，下面优优列举七条。</p><p>（1）做事专注。专注的人，更容易获得成功。爱因斯坦说“实笃一个人只有以他全部的力量和精神致力于某一事业时，才能成为一个真正的大师。因此，只有全力以赴才能精通” 。程序员就是这样一个群体，他们做事非常专注，除了睡觉，几乎每天都和代码粘在一起，难怪有人会说程序员的女朋友就是代码和键盘，虽只是调侃，但也说明了程序员对这份职业的无比热爱和专注。</p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-e3b96c00804ff72a.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\"><br></p><p>（2）聪明好学。聪明，是外界给予程序员普遍的认同。一名合格的程序员，他们都拥有非常强的逻辑思维能力和对业务的解读能力，而且他们热爱学习，喜欢专研技术。如果你问他们不上班的时候都在干嘛，你得到的答案肯定是在家专研技术。</p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-c2e7a067915bd0a1.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\"><br></p><p>（3）热爱分享。分享就是学习，程序员很明白这个道理。他们乐于分享，并且是无私的。如果要给热爱分享的群体排个名次，程序员肯定能进入前三名。当年博客最火热的时候，几乎所有熟悉网络的人都拥有一个博客，但是时至今日，除了程序员这个群体还在坚持分享外，还有哪个群体如此积极？几乎没有。</p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-31b44daba422a456.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\"><br></p><p>（4）很有耐心。一个项目代码量成千上万行，写完后还得不断改bug，如果没有足够的耐心，只是代码量估计就得把人整得晕乎乎的，更别提需要花大量时间改bug了。在一些小公司，程序员基本上还包揽了公司的一切网络工作及相关咨询工作，凡事有人电脑出现问题，第一个找的必是程序员，而且他们都会耐心解答。</p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-9726f6b201ec4a98.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\"><br></p><p> （6）很有责任心。责任心是衡量一个做程序员是否合格的重要因素之一，也是程序员的必备品质之一。管理学中有言：三分靠技术，七分靠管理。对程序开发来说则是：三分靠技术，七分靠责任心。所以一名合格的程序员，必然也有很强的责任心。</p><p>（7）别样的幽默感。程序员用特有的方式向我们表现他们的幽默和可爱的一面。下面的这些段子你能看懂吗？</p><p><img src=\"http://upload-images.jianshu.io/upload_images/109661-d696f210be114a92.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240\"><br></p><p>问：中国第一位程序猿是谁？答：沈从文，他写了本书叫《边城》。问：那最风骚的程序猿是谁？答：是古龙，因为他写了《边城浪子》。</p><p>世界上最好的语言PHP，知道程序员缺钱，所以每个变量都以$开头。</p><p>世界上最遥远的距离不是生与死，而是你亲手制造的BUG就在你眼前，你却怎么都找不到她。</p><p>当然除了这些之外，程序员还热衷科技产品，参加技术流会等等。</p><p>关于加班</p><p>网上流传着一个关于科比的励志故事（真实性存疑）。</p><p>记者问：“你为什么能如此成功呢?”科比反问道：“你知道洛杉矶凌晨四点钟是什么样子吗?”记者摇摇头：“不知道，那你说说洛杉矶每天早上四点钟究竟什么样儿?”科比挠挠头，说：“满天星星，寥落的灯光，行人很少。”</p><p>段子手们再一次发挥了他们神技特长。</p><p>于是有了下面的程序员版本：</p><p>程序猿问科比：“你为什么这么成功？ ”科比：“你知道洛杉矶凌晨四点是什么样子吗？ ”程序猿：“知道，一般那个时候我还在写代码，怎么了？”科比：“额…….”</p><p>虽然只是调侃，但是的确也反应了程序员加班的严重性。</p><p>那么，我们该何如看待这个问题？</p><p>加班是每个行业都存在的问题，首先我们应该正视这个问题。任何抱怨都是解决不了问题的。命运掌握在自己手里，自己最熟悉自己的身体，环境我们无法改变，但是我们可以改变我们的选择。</p><p>工作与身体，孰轻孰重，不言自明。</p><p>爱惜自己，就是对自己负责，对家人负责。</p><p>生命诚可贵，且行且珍惜。</p><p>总结</p><p>程序员是值得尊敬的，他们把美好的年华献给了技术，他们把枯燥的代码变为神奇好玩的应用程序，为这多彩缤纷的世界做出了不可磨灭的贡献。</p><p>一切强加给程序员的标签，咱们都应当表示不接受、不承认、不赞同。</p><p><br><br></p><p>文／千里马君（简书作者）</p><p><br></p><p>原文链接：http://www.jianshu.com/p/d89eff020222</p><p><br></p><p>著作权归作者所有，转载请联系作者获得授权，并标注“简书作者”。</p><p><br></p>',	0,	'',	1,	1482508800,	1482560220,	0);


-- --------------------------------------------------------

DROP TABLE IF EXISTS `nd_blog_cate`;

CREATE TABLE `nd_blog_cate` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `cate_name` varchar(30) NOT NULL COMMENT '分类',
  `cate_flag` varchar(20) NOT NULL DEFAULT '' COMMENT '分类标识',
  `cate_info` varchar(150) NOT NULL DEFAULT '' COMMENT '分类介绍',
  `cate_sort` int(11) NOT NULL DEFAULT '0' COMMENT '排序',
  `cate_status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '状态',
  `create_time` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  `update_time` int(11) NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `cate_flag` (`cate_flag`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

INSERT INTO `nd_blog_cate` (`id`, `cate_name`, `cate_flag`, `cate_info`, `cate_sort`, `cate_status`, `create_time`, `update_time`) VALUES
(1,	'生活',	'life',	'生活...',	0,	1,	1481643532,	1482553682),
(2,	'程序',	'code',	'程序...',	0,	1,	1481643554,	1482558658),
(3,	'旅行',	'travel',	'旅行...',	0,	1,	1481643619,	1482553691);


-- --------------------------------------------------------

DROP TABLE IF EXISTS `nd_manage_config`;

CREATE TABLE `nd_manage_config` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `config_name` varchar(30) NOT NULL COMMENT '配置名称',
  `config_value` varchar(1000) NOT NULL DEFAULT '' COMMENT '配置值',
  `config_type` varchar(10) NOT NULL COMMENT '配置类型',
  `config_title` varchar(30) NOT NULL DEFAULT '' COMMENT '配置标题',
  `config_group` varchar(10) NOT NULL DEFAULT '' COMMENT '配置分组',
  `config_extra` text NOT NULL COMMENT '额外配置',
  `config_sort` int(11) NOT NULL DEFAULT '0' COMMENT '配置排序',
  `config_remark` varchar(150) NOT NULL DEFAULT '' COMMENT '备注',
  `create_time` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  `update_time` int(11) NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `config_name` (`config_name`)
) ENGINE=InnoDB AUTO_INCREMENT=33 DEFAULT CHARSET=utf8;

INSERT INTO `nd_manage_config` (`id`, `config_name`, `config_value`, `config_type`, `config_title`, `config_group`, `config_extra`, `config_sort`, `config_remark`, `create_time`, `update_time`) VALUES
(1,	'app_debug',	'0',	'radio',	'调试模式',	'核心',	'0:关闭|1:开启',	1,	'',	1474430754,	1474506766),
(2,	'app_trace',	'0',	'radio',	'应用Trace',	'核心',	'0:关闭|1:开启',	2,	'',	1474435997,	1474506766),
(3,	'url_convert',	'0',	'radio',	'转换URL',	'核心',	'0:不转换|1:转换',	3,	'',	1474430370,	1474506766),
(4,	'url_route_on',	'1',	'radio',	'开启路由',	'核心',	'0:关闭|1:开启',	4,	'',	1474435482,	1474506766),
(5,	'url_route_must',	'0',	'radio',	'强制路由',	'核心',	'0:不强制|1:强制使用',	5,	'',	1474435583,	1474506766),
(6,	'url_domain_deploy',	'1',	'radio',	'域名部署',	'核心',	'0:否|1:是',	6,	'',	1474430531,	1474506766),
(7,	'url_domain_root',	'cms.newday.me',	'text',	'网站域名',	'核心',	'',	7,	'',	1474430459,	1474506766),
(8,	'log',	'{\"type\":\"File\",\"path\":\"{LOG_PATH}\",\"level\":\"\"}',	'array',	'日志设置',	'核心',	'type,path,level',	8,	'',	1474435664,	1474506766),
(9,	'trace',	'{\"type\":\"Html\"}',	'array',	'Trace设置',	'核心',	'type',	9,	'',	1474435855,	1474506766),
(10,	'cache',	'{\"type\":\"File\",\"path\":\"{CACHE_PATH}\",\"prefix\":\"\",\"expire\":0}',	'array',	'缓存设置',	'核心',	'type,path,prefix,expire',	10,	'',	1474435908,	1474506766),
(11,	'session',	'{\"id\":\"\",\"var_session_id\":\"\",\"prefix\":\"think\",\"type\":\"\",\"auto_start\":1}',	'array',	'会话设置',	'核心',	'id,var_session_id,prefix,type,auto_start',	11,	'',	1474462820,	1474506766),
(12,	'cookie',	'{\"prefix\":\"\",\"expire\":0,\"path\":\"\\/\",\"domain\":\"\",\"secure\":0,\"httponly\":\"\",\"setcookie\":1}',	'array',	'Cookie设置',	'核心',	'prefix,expire,path,domain,secure,httponly,setcookie',	12,	'',	1474465033,	1474506766),
(14,	'manage_rows_num',	'10',	'text',	'每页条数',	'后台',	'',	51,	'',	1474649656,	1482591567),
(15,	'manage_driver_login',	'cookie',	'radio',	'登录驱动',	'后台',	'cookie:Cookie驱动|session:Session驱动',	52,	'',	1474421089,	1482591567),
(16,	'manage_public_action',	'[\"manage.start.*\"]',	'array',	'公共行为',	'后台',	'',	53,	'',	1474434515,	1482591567),
(17,	'site_title',	'NewDayCms - 哩呵后台管理系统',	'text',	'网站标题',	'网站',	'',	100,	'',	1469798091,	1481639542),
(18,	'site_version',	'2016-12-13',	'date',	'网站版本',	'网站',	'',	101,	'',	1474127435,	1481639542),
(20,	'site_base',	'/',	'text',	'网站目录',	'网站',	'',	103,	'',	1474429365,	1481639542),
(21,	'site_keyword',	'哩呵,CMS,ThinkPHP,后台,管理系统',	'textarea',	'网站关键字',	'网站',	'',	104,	'',	1474176263,	1481639542),
(22,	'site_description',	'NewdayCms ，简单的方式管理数据。期待你的参与，共同打造一个功能更强大的通用后台管理系统。',	'textarea',	'网站描述',	'网站',	'',	105,	'',	1474176302,	1481639542),
(23,	'bakup_path',	'{ROOT_PATH}bakup',	'text',	'备份路径',	'网站',	'',	106,	'',	1474468252,	1481639542),
(24,	'upload_driver',	'upyun',	'radio',	'上传驱动',	'上传',	'upyun:又拍云|local:本地',	200,	'',	1474174215,	1482505519),
(25,	'upload_type',	'{\"image\":[\"jpg\",\"png\",\"gif\",\"bmp\"],\"audio\":[\"mp3\",\"ogg\",\"m4a\",\"wav\",\"ape\",\"flac\"],\"video\":[\"mp4\",\"mov\",\"mpg\",\"flv\",\"mkv\",\"avi\"],\"compress\":[\"zip\",\"rar\",\"7z\"],\"document\":[\"doc\",\"xls\",\"ppt\",\"docx\",\"xlsx\",\"pptx\",\"pdf\"]}',	'array',	'允许上传类型',	'上传',	'image,audio,video,compress,document',	201,	'',	1474174295,	1482505519),
(26,	'upload_local',	'{\"root\":\"{WEB_PATH}\\/upload\\/\",\"url\":\"http:\\/\\/cms.newday.me\\/upload\\/\"}',	'array',	'本地配置',	'上传',	'root,url',	202,	'',	1474174580,	1482505519),
(27,	'upload_upyun',	'{\"bucket\":\"newday-static\",\"user\":\"\",\"passwd\":\"\",\"root\":\"\",\"url\":\"\",\"key\":\"\",\"size\":2,\"maxsize\":3,\"return\":\"\",\"notify\":\"\"}',	'array',	'又拍云配置',	'上传',	'bucket,user,passwd,root,url,key,size,maxsize,return,notify',	203,	'',	1474174375,	1482505519),
(32,	'manage_theme',	'white',	'radio',	'后台主题',	'后台',	'white:清新白|blue:复古蓝',	50,	'',	1474538750,	1482591567);


-- --------------------------------------------------------

DROP TABLE IF EXISTS `nd_manage_database`;

CREATE TABLE `nd_manage_database` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `dump_uid` int(11) NOT NULL COMMENT '用户ID',
  `dump_size` int(11) NOT NULL DEFAULT '0' COMMENT '文件大小',
  `dump_file` varchar(150) NOT NULL COMMENT '导出文件',
  `dump_time` int(11) NOT NULL DEFAULT '0' COMMENT '导出时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;



-- --------------------------------------------------------

DROP TABLE IF EXISTS `nd_manage_file`;

CREATE TABLE `nd_manage_file` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `file_hash` varchar(32) NOT NULL COMMENT '文件哈希',
  `file_type` varchar(10) NOT NULL DEFAULT '' COMMENT '文件类型',
  `file_ext` varchar(10) DEFAULT '' COMMENT '文件后缀',
  `file_size` int(11) NOT NULL DEFAULT '0' COMMENT '文件大小',
  `file_url` varchar(100) NOT NULL DEFAULT '' COMMENT '文件链接',
  `create_time` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `file_hash` (`file_hash`) USING BTREE,
  KEY `file_type` (`file_type`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

INSERT INTO `nd_manage_file` (`id`, `file_hash`, `file_type`, `file_ext`, `file_size`, `file_url`, `create_time`) VALUES
(1,	'37d8d59622c7cbe6754c2c5b8e86010c',	'image',	'jpg',	85295,	'//static.newday.me/cms/image/37d8d59622c7cbe6754c2c5b8e86010c.jpg',	1482505588),
(2,	'5a416ee8a89ae2e754417c4beb97b562',	'image',	'jpg',	34288,	'//static.newday.me/cms/image/5a416ee8a89ae2e754417c4beb97b562.jpg',	1482505619),
(3,	'd46af9079bbbc27047e5f0ebb9fc4dfc',	'image',	'jpg',	32334,	'//static.newday.me/cms/image/d46af9079bbbc27047e5f0ebb9fc4dfc.jpg',	1482506291),
(4,	'59da05b04ddb4da914f0f40647aaefd1',	'image',	'jpg',	59332,	'//static.newday.me/cms/image/59da05b04ddb4da914f0f40647aaefd1.jpg',	1482506951),
(5,	'bf4567030419c0317b506afb6ed6d027',	'image',	'jpg',	16743,	'//static.newday.me/cms/image/bf4567030419c0317b506afb6ed6d027.jpg',	1482507237),
(6,	'994ce6898ed231e8c281763b3521e08e',	'image',	'jpg',	28406,	'//static.newday.me/cms/image/994ce6898ed231e8c281763b3521e08e.jpg',	1482507808),
(7,	'39a32aaf254b7d6d188e1437cd77e7fb',	'image',	'jpg',	35075,	'//static.newday.me/cms/image/39a32aaf254b7d6d188e1437cd77e7fb.jpg',	1482554637),
(8,	'be63d8121ba39b1b9b62ed2f155de410',	'image',	'jpg',	28831,	'//static.newday.me/cms/image/be63d8121ba39b1b9b62ed2f155de410.jpg',	1482559037);


-- --------------------------------------------------------

DROP TABLE IF EXISTS `nd_manage_job`;

CREATE TABLE `nd_manage_job` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `queue` varchar(255) NOT NULL,
  `payload` longtext NOT NULL,
  `attempts` tinyint(3) unsigned NOT NULL,
  `reserved` tinyint(3) unsigned NOT NULL DEFAULT '0',
  `reserved_at` int(10) unsigned DEFAULT '0',
  `available_at` int(10) unsigned NOT NULL DEFAULT '0',
  `created_at` int(10) unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;



-- --------------------------------------------------------

DROP TABLE IF EXISTS `nd_manage_member`;

CREATE TABLE `nd_manage_member` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT '用户ID',
  `user_name` char(16) NOT NULL COMMENT '用户名',
  `user_passwd` char(32) NOT NULL COMMENT '密码',
  `user_nick` varchar(150) NOT NULL DEFAULT '',
  `group_id` int(11) NOT NULL COMMENT '所属分组',
  `user_status` tinyint(4) NOT NULL DEFAULT '0' COMMENT '用户状态',
  `login_time` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '最后登录时间',
  `login_ip` varchar(20) NOT NULL DEFAULT '' COMMENT '最后登录IP',
  `login_count` int(11) NOT NULL DEFAULT '0' COMMENT '登录次数',
  `create_time` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '注册时间',
  `update_time` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `username` (`user_name`),
  KEY `status` (`user_status`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='用户表';

INSERT INTO `nd_manage_member` (`id`, `user_name`, `user_passwd`, `user_nick`, `group_id`, `user_status`, `login_time`, `login_ip`, `login_count`, `create_time`, `update_time`) VALUES
(1,	'admin',	'70f7c043f9e771d782a57592673b8309',	'管理员',	1,	1,	1479519614,	'183.157.10.169',	20,	1469798091,	1482475897),
(2,	'demo',	'75990d0a7e95e01c7f372f540e9b992a',	'游客',	2,	1,	1482476247,	'36.24.136.68',	504,	1474475386,	1482476247);


-- --------------------------------------------------------

DROP TABLE IF EXISTS `nd_manage_member_group`;

CREATE TABLE `nd_manage_member_group` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT '用户组id,自增主键',
  `group_name` varchar(20) NOT NULL DEFAULT '' COMMENT '用户组中文名称',
  `group_info` varchar(80) NOT NULL DEFAULT '' COMMENT '描述信息',
  `home_page` varchar(150) NOT NULL DEFAULT '' COMMENT '登录首页',
  `group_menus` varchar(1000) NOT NULL DEFAULT '' COMMENT '用户组允许访问的菜单',
  `group_status` tinyint(1) NOT NULL DEFAULT '1' COMMENT '用户组状态',
  `create_time` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  `update_time` int(11) NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

INSERT INTO `nd_manage_member_group` (`id`, `group_name`, `group_info`, `home_page`, `group_menus`, `group_status`, `create_time`, `update_time`) VALUES
(1,	'管理员',	'管理网站',	'manage/index/index',	'1,2,13,3,4,14,15,16,17,5,18,19,20,21,22,41,42,7,23,24,25,26,27,8,28,29,30,31,32,6,53,9,33,10,34,11,35,36,37,12,38,40,43,45,46,47,48,44,49,50,51,52',	1,	1473874915,	1482562697),
(2,	'游客',	'体验系统',	'manage/index/index',	'1,2,13,3,4,14,15,5,18,19,41,7,23,24,8,28,29,6,53,9,33,10,11,12,40,43,45,46,44,49,50',	1,	1473874915,	1482594895);


-- --------------------------------------------------------

DROP TABLE IF EXISTS `nd_manage_member_log`;

CREATE TABLE `nd_manage_member_log` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `login_uid` int(8) NOT NULL COMMENT '用户ID',
  `login_ip` varchar(20) NOT NULL DEFAULT '' COMMENT '登录IP',
  `login_agent` varchar(250) NOT NULL DEFAULT '' COMMENT '客户端标识',
  `create_time` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  `update_time` int(11) NOT NULL DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=55 DEFAULT CHARSET=utf8;

INSERT INTO `nd_manage_member_log` (`id`, `login_uid`, `login_ip`, `login_agent`, `create_time`, `update_time`) VALUES
(1,	2,	'125.68.114.158',	'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/54.0.2840.71 Safari/537.36',	1479512812,	1479512812),
(2,	2,	'183.157.10.169',	'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/48.0.2564.82 Safari/537.36',	1479517534,	1479517534),
(3,	1,	'183.157.10.169',	'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/48.0.2564.82 Safari/537.36',	1479519614,	1479519614),
(4,	2,	'42.199.132.148',	'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/49.0.2587.3 Safari/537.36',	1479521271,	1479521271),
(5,	2,	'36.44.141.85',	'Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.101 Safari/537.36',	1479522454,	1479522454),
(6,	2,	'183.39.118.11',	'Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:50.0) Gecko/20100101 Firefox/50.0',	1479523569,	1479523569),
(7,	2,	'183.157.10.169',	'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/48.0.2564.82 Safari/537.36',	1479529432,	1479529432),
(8,	2,	'123.119.35.49',	'Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/49.0.2623.22 Safari/537.36 SE 2.X MetaSr 1.0',	1479530201,	1479530201),
(9,	2,	'47.89.15.179',	'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/54.0.2840.99 Safari/537.36',	1479531736,	1479531736),
(10,	2,	'183.5.253.118',	'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.104 Safari/537.36 Core/1.53.1708.400 QQBrowser/9.5.9635.400',	1479533899,	1479533899),
(11,	2,	'58.101.97.76',	'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/54.0.2840.99 Safari/537.36',	1479653911,	1479653911),
(12,	2,	'218.19.34.189',	'Mozilla/5.0 (Windows NT 10.0; WOW64; Trident/7.0; MSIE 8.0; rv:11.0) like Gecko Core/1.47.933.400 QQBrowser/9.4.8699.400',	1479709977,	1479709977),
(13,	2,	'58.101.97.76',	'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/54.0.2840.99 Safari/537.36',	1479996228,	1479996228),
(14,	2,	'222.82.222.78',	'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.143 Safari/537.36',	1480037868,	1480037868),
(15,	2,	'125.120.87.16',	'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:44.0) Gecko/20100101 Firefox/44.0',	1480043316,	1480043316),
(16,	2,	'182.201.241.187',	'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/54.0.2840.71 Safari/537.36',	1480053222,	1480053222),
(17,	2,	'14.17.22.34',	'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/52.0.2743.116 Safari/537.36',	1480058191,	1480058191),
(18,	2,	'1.27.51.180',	'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:50.0) Gecko/20100101 Firefox/50.0',	1480063086,	1480063086),
(19,	2,	'223.104.176.221',	'Mozilla/5.0 (Linux; Android 5.1.1; vivo V3Max A Build/LMY47V) AppleWebKit/537.36 (KHTML, like Gecko) Version/4.0 Chrome/37.0.0.0 Mobile MQQBrowser/6.8 TBS/036872 Safari/537.36 MicroMessenger/6.3.28.900 NetType/cmnet Language/zh_CN',	1480067076,	1480067076),
(20,	2,	'175.190.90.105',	'Mozilla/5.0 (Windows NT 10.0; WOW64; rv:49.0) Gecko/20100101 Firefox/49.0',	1480074813,	1480074813),
(21,	2,	'220.200.31.127',	'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/54.0.2840.99 Safari/537.36',	1480090655,	1480090655),
(22,	2,	'123.151.42.48',	'Mozilla/5.0 (Linux; Android 6.0; KNT-UL10 Build/HUAWEIKNT-UL10) AppleWebKit/537.36 (KHTML, like Gecko) Version/4.0 Chrome/37.0.0.0 Mobile MQQBrowser/6.8 TBS/036872 Safari/537.36 MicroMessenger/6.3.31.940 NetType/WIFI Language/zh_CN',	1480114230,	1480114230),
(23,	2,	'182.201.145.20',	'Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/48.0.2564.116 Safari/537.36',	1480236355,	1480236355),
(24,	2,	'223.102.2.13',	'Mozilla/5.0 (Windows NT 5.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/50.0.2661.102 UBrowser/5.7.16400.16 Safari/537.36',	1480314663,	1480314663),
(25,	2,	'221.232.21.19',	'Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 10.0; WOW64; Trident/7.0; .NET4.0C; .NET4.0E; .NET CLR 2.0.50727; .NET CLR 3.0.30729; .NET CLR 3.5.30729)',	1480432637,	1480432637),
(26,	2,	'36.149.196.241',	'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36',	1480483787,	1480483787),
(27,	2,	'111.121.124.123',	'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/50.0.2661.102 Safari/537.36',	1480486697,	1480486697),
(28,	2,	'119.2.5.19',	'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/50.0.2661.102 Safari/537.36',	1480490265,	1480490265),
(29,	2,	'180.106.17.234',	'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.101 Safari/537.36',	1480560713,	1480560713),
(30,	2,	'111.14.144.47',	'Mozilla/5.0 (Windows NT 10.0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.101 Safari/537.36',	1480687762,	1480687762),
(31,	2,	'125.119.239.54',	'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/54.0.2840.59 Safari/537.36',	1480863798,	1480863798),
(32,	2,	'222.83.148.253',	'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.101 Safari/537.36',	1480928700,	1480928700),
(33,	2,	'117.158.88.43',	'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Maxthon/4.9.4.2000 Chrome/39.0.2146.0 Safari/537.36',	1481241305,	1481241305),
(34,	2,	'222.83.148.253',	'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.101 Safari/537.36',	1481278870,	1481278870),
(35,	2,	'36.151.173.245',	'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.75 Safari/537.36',	1481341462,	1481341462),
(36,	2,	'127.0.0.1',	'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/54.0.2840.99 Safari/537.36',	1481450569,	1481450569),
(37,	2,	'221.237.156.27',	'Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.3; WOW64; Trident/7.0; .NET4.0E; .NET4.0C; .NET CLR 3.5.30729; .NET CLR 2.0.50727; .NET CLR 3.0.30729; InfoPath.3)',	1481527313,	1481527313),
(38,	2,	'183.159.183.104',	'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/48.0.2564.82 Safari/537.36',	1481678845,	1481678845),
(39,	2,	'36.149.132.24',	'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.75 Safari/537.36',	1481718937,	1481718937),
(40,	2,	'124.93.46.25',	'Mozilla/5.0 (Windows NT 10.0; WOW64; rv:50.0) Gecko/20100101 Firefox/50.0',	1481791745,	1481791745),
(41,	2,	'222.83.151.141',	'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.101 Safari/537.36',	1481907682,	1481907682),
(42,	2,	'116.24.6.121',	'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.87 Safari/537.36',	1481954616,	1481954616),
(43,	2,	'116.24.6.121',	'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.87 Safari/537.36',	1481955858,	1481955858),
(44,	2,	'122.156.219.200',	'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.87 Safari/537.36',	1481979296,	1481979296),
(45,	2,	'113.118.180.231',	'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.87 Safari/537.36',	1482125782,	1482125782),
(46,	2,	'112.22.234.247',	'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.75 Safari/537.36',	1482238493,	1482238493),
(47,	2,	'119.123.87.98',	'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.87 Safari/537.36',	1482290601,	1482290601),
(48,	2,	'125.120.80.44',	'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_12_1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/52.0.2743.116 Safari/537.36',	1482291198,	1482291198),
(49,	2,	'117.158.88.43',	'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Maxthon/4.9.4.2000 Chrome/39.0.2146.0 Safari/537.36',	1482364774,	1482364774),
(50,	2,	'113.90.69.5',	'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.87 Safari/537.36',	1482372998,	1482372998),
(51,	2,	'113.99.23.153',	'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.101 Safari/537.36',	1482394482,	1482394482),
(52,	2,	'113.99.23.107',	'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.101 Safari/537.36',	1482459759,	1482459759),
(53,	2,	'127.0.0.1',	'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/48.0.2564.82 Safari/537.36',	1482475308,	1482475308),
(54,	2,	'36.24.136.68',	'Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/48.0.2564.82 Safari/537.36',	1482476247,	1482476247);


-- --------------------------------------------------------

DROP TABLE IF EXISTS `nd_manage_menu`;

CREATE TABLE `nd_manage_menu` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT COMMENT '文档ID',
  `menu_name` varchar(50) NOT NULL DEFAULT '' COMMENT '标题',
  `menu_pid` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '上级分类ID',
  `menu_sort` int(11) unsigned NOT NULL DEFAULT '0' COMMENT '排序（同级有效）',
  `menu_url` char(255) NOT NULL DEFAULT '' COMMENT '链接地址',
  `menu_group` varchar(50) NOT NULL DEFAULT '' COMMENT '分组',
  `menu_flag` varchar(255) NOT NULL DEFAULT '' COMMENT '菜单标识',
  `menu_build` tinyint(4) NOT NULL DEFAULT '1' COMMENT '是否需要build',
  `menu_target` varchar(10) NOT NULL DEFAULT '' COMMENT '打开方式',
  `menu_status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '状态',
  `create_time` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  `update_time` int(11) NOT NULL DEFAULT '0' COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `pid` (`menu_pid`),
  KEY `status` (`menu_status`)
) ENGINE=MyISAM AUTO_INCREMENT=54 DEFAULT CHARSET=utf8;

INSERT INTO `nd_manage_menu` (`id`, `menu_name`, `menu_pid`, `menu_sort`, `menu_url`, `menu_group`, `menu_flag`, `menu_build`, `menu_target`, `menu_status`, `create_time`, `update_time`) VALUES
(1,	'系统',	0,	0,	'',	'',	'manage/menu/editMenu',	1,	'_self',	1,	1473913119,	1481646294),
(2,	'控制台',	1,	0,	'manage/index/index',	'网站',	'manage/index/index',	1,	'_self',	1,	1473913119,	1474137908),
(3,	'网站设置',	1,	1,	'manage/config/setting',	'网站',	'manage/config/setting',	1,	'_self',	1,	1474135187,	1474137743),
(4,	'配置管理',	1,	2,	'manage/config/index',	'网站',	'manage/config/index',	1,	'_self',	1,	1474122400,	1474137745),
(5,	'菜单管理',	1,	3,	'manage/menu/index',	'网站',	'manage/menu/index',	1,	'_self',	1,	1473913119,	1474219246),
(6,	'登录日志',	1,	12,	'manage/memberLog/index',	'用户',	'manage/memberLog/index',	1,	'_self',	1,	1473926393,	1479447040),
(7,	'用户群组',	1,	10,	'manage/memberGroup/index',	'用户',	'manage/memberGroup/index',	1,	'_self',	1,	1473913119,	1474137479),
(8,	'用户管理',	1,	11,	'manage/member/index',	'用户',	'manage/member/index',	1,	'_self',	1,	1473913119,	1474137485),
(9,	'上传文件',	1,	40,	'manage/file/upload',	'文件',	'manage/file/upload',	1,	'_self',	1,	1474218531,	1474218595),
(10,	'附件管理',	1,	41,	'manage/file/index',	'文件',	'manage/file/index',	1,	'_self',	1,	1474218590,	1474218600),
(11,	'数据备份',	1,	50,	'manage/database/index',	'数据库',	'manage/database/index',	1,	'_self',	1,	1473956210,	1474218550),
(12,	'备份记录',	1,	51,	'manage/database/bakupLog',	'数据库',	'manage/database/bakupLog',	1,	'_self',	1,	1473959958,	1474218554),
(13,	'账户设置',	2,	0,	'manage/index/account',	'',	'manage/index/account',	1,	'_self',	1,	1473918347,	1473918347),
(14,	'添加配置',	4,	0,	'manage/config/addConfig',	'',	'manage/config/addConfig',	1,	'_self',	1,	1474126097,	1474126097),
(15,	'编辑配置',	4,	0,	'manage/config/editConfig',	'',	'manage/config/editConfig',	1,	'_self',	1,	1474126112,	1474126112),
(16,	'更改配置',	4,	0,	'manage/config/modifyConfig',	'',	'manage/config/modifyConfig',	1,	'_self',	1,	1474126150,	1474126150),
(17,	'删除配置',	4,	0,	'manage/config/delConfig',	'',	'manage/config/delConfig',	1,	'_self',	1,	1474126175,	1474126175),
(18,	'新增菜单',	5,	0,	'manage/menu/addMenu',	'',	'manage/menu/addMenu',	1,	'_self',	1,	1473913119,	1473919027),
(19,	'编辑菜单',	5,	0,	'manage/menu/editMenu',	'',	'manage/menu/editMenu',	1,	'_self',	1,	1473913119,	1473919027),
(20,	'删除菜单',	5,	0,	'manage/menu/delMenu',	'',	'manage/menu/delMenu',	1,	'_self',	1,	1473913119,	1473919027),
(21,	'更改排序',	5,	0,	'manage/menu/modifySort',	'',	'manage/menu/modifySort',	1,	'_self',	1,	1473913119,	1473913322),
(22,	'更改状态',	5,	0,	'manage/menu/modifyStatus',	'',	'manage/menu/modifyStatus',	1,	'_self',	1,	1473913119,	1473913316),
(23,	'添加群组',	7,	0,	'manage/memberGroup/addGroup',	'',	'manage/memberGroup/addGroup',	1,	'_self',	1,	1473913119,	1473919027),
(24,	'编辑群组',	7,	0,	'manage/memberGroup/editGroup',	'',	'manage/memberGroup/editGroup',	1,	'_self',	1,	1473913119,	1473913068),
(25,	'群组权限',	7,	0,	'manage/memberGroup/editAuth',	'',	'manage/memberGroup/editAuth',	1,	'_self',	1,	1473913119,	1473913148),
(26,	'删除群组',	7,	0,	'manage/memberGroup/delGroup',	'',	'manage/memberGroup/delGroup',	1,	'_self',	1,	1473913135,	1473913135),
(27,	'更改状态',	7,	0,	'manage/memberGroup/modifyStatus',	'',	'manage/memberGroup/modifyStatus',	1,	'_self',	1,	1473913166,	1473913297),
(28,	'添加用户',	8,	0,	'manage/member/addMember',	'',	'manage/member/addMember',	1,	'_self',	1,	1473913204,	1473913204),
(29,	'编辑用户',	8,	0,	'manage/member/editMember',	'',	'manage/member/editMember',	1,	'_self',	1,	1473913215,	1473913215),
(30,	'删除用户',	8,	0,	'manage/member/delMember',	'',	'manage/member/delMember',	1,	'_self',	1,	1473913245,	1473913245),
(31,	'更改群组',	8,	0,	'manage/member/modifyGroup',	'',	'manage/member/modifyGroup',	1,	'_self',	1,	1473913260,	1473913260),
(32,	'更改状态',	8,	0,	'manage/member/modifyStatus',	'',	'manage/member/modifyStatus',	1,	'_self',	1,	1473913278,	1473913278),
(33,	'文件上传',	9,	0,	'manage/upload/upload',	'',	'http:/cms',	1,	'_self',	1,	1474469128,	1474469128),
(34,	'删除附件',	10,	0,	'manage/file/delFile',	'',	'manage/file/delFile',	1,	'_self',	1,	1474392650,	1474392650),
(35,	'备份数据库',	11,	0,	'manage/database/bakup',	'',	'manage/database/bakup',	1,	'_self',	1,	1473962050,	1473962050),
(36,	'优化数据库',	11,	0,	'manage/database/optimize',	'',	'manage/database/optimize',	1,	'_self',	1,	1473962107,	1474392764),
(37,	'修复数据库',	11,	0,	'manage/database/repair',	'',	'manage/database/repair',	1,	'_self',	1,	1473962139,	1474392770),
(38,	'删除记录',	12,	0,	'manage/database/delBakup',	'',	'manage/database/delBakup',	1,	'_self',	1,	1473962185,	1473962185),
(53,	'任务列表',	1,	30,	'manage/job/index',	'队列',	'manage/job/index',	1,	'_self',	1,	1482562670,	1482588939),
(40,	'内容',	0,	0,	'',	'',	'd41d8cd98f00b204e9800998ecf8427e',	0,	'_self',	1,	1479482606,	1481646298),
(41,	'缓存管理',	1,	4,	'manage/index/runtime',	'网站',	'manage/index/runtime',	1,	'_self',	1,	1479656009,	1479656032),
(42,	'删除缓存',	41,	0,	'manage/index/delRuntime',	'',	'manage/index/delRuntime',	1,	'_self',	1,	1479828090,	1479828090),
(43,	'文章分类',	40,	0,	'@module/blog/articleCate/index',	'博客',	'module/blog/articleCate/index',	1,	'_self',	1,	1481642960,	1481643402),
(44,	'文章管理',	40,	0,	'@module/blog/article/index',	'博客',	'module/blog/article/index',	1,	'_self',	1,	1481643055,	1481643405),
(45,	'添加分类',	43,	0,	'@module/blog/articleCate/addCate',	'',	'module/blog/articleCate/addCate',	1,	'_self',	1,	1481643080,	1481643421),
(46,	'编辑分类',	43,	0,	'@module/blog/articleCate/editCate',	'',	'module/blog/articleCate/editCate',	1,	'_self',	1,	1481643093,	1481643425),
(47,	'删除分类',	43,	0,	'@module/blog/articleCate/delCate',	'',	'module/blog/articleCate/delCate',	1,	'_self',	1,	1481643105,	1481643428),
(48,	'更改分类',	43,	0,	'@module/blog/articleCate/modifyCate',	'',	'module/blog/articleCate/modifyCate',	1,	'_self',	1,	1481643119,	1481643431),
(49,	'添加文章',	44,	0,	'@module/blog/article/addArticle',	'',	'module/blog/article/addArticle',	1,	'_self',	1,	1481643149,	1481643444),
(50,	'编辑文章',	44,	0,	'@module/blog/article/editArticle',	'',	'module/blog/article/editArticle',	1,	'_self',	1,	1481643162,	1481643448),
(51,	'删除文章',	44,	0,	'@module/blog/article/delArticle',	'',	'module/blog/article/delArticle',	1,	'_self',	1,	1481643173,	1481643451),
(52,	'更改文章',	44,	0,	'@module/blog/article/modifyArticle',	'',	'module/blog/article/modifyArticle',	1,	'_self',	1,	1481643183,	1481643454);


-- THE END
